[
    {
        "title": "When Your $2M Security Detection Fails: Can your SOC Save You?",
        "url": "https://thehackernews.com/2025/11/when-your-2m-security-detection-fails.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjkw0MmcqqKZNxhyucPZCx6y1I2RgOoB3X4reu6qVkLYeMWCdU4jfxo_lQTdLLwRFdA2bVjxw_0F-QyR0XXpAV-v-commkh3NcxuOr3QOEtD0zkc-fvTavnhG-gO8z7ttXhevDQU9O3hb1Id6iBSjOH4GFmhoNRWPCPpJL8kYR6U5_seYnwxQUnwLWqz48/s790-rw-e365/million-dollar-soc.jpg",
        "description": "Enterprises today are expected to have at least 6-8 detection tools, as detection is considered a standard investment and the first line of defense. Yet security leaders struggle to justify dedicating resources further down the alert lifecycle to their superiors.  As a result, most organizations' security investments are asymmetrical, robust detection tools paired with an under-resourced SOC, their last line of defense.  A recent case study  demonstrates how companies with a standardized SOC prevented a sophisticated phishing attack that bypassed leading email security tools. In this case study, a cross-company phishing campaign targeted C-suite executives at multiple enterprises. Eight different email security tools across these organizations failed to detect the attack, and phishing emails reached executive inboxes. However, each organization's SOC team detected the attack immediately after employees reported the suspicious emails.  Why did all eight detection tools identica...",
        "content": "Enterprises today are expected to have at least 6-8 detection tools, as detection is considered a standard investment and the first line of defense. Yet security leaders struggle to justify dedicating resources further down the alert lifecycle to their superiors.\n\nAs a result, most organizations' security investments are asymmetrical, robust detection tools paired with an under-resourced SOC, their last line of defense.\n\nA recentcase studydemonstrates how companies with a standardized SOC prevented a sophisticated phishing attack that bypassed leading email security tools. In this case study, a cross-company phishing campaign targeted C-suite executives at multiple enterprises. Eight different email security tools across these organizations failed to detect the attack, and phishing emails reached executive inboxes. However, each organization's SOC team detected the attack immediately after employees reported the suspicious emails.\n\nWhy did all eight detection tools identically fail where the SOC succeeded?\n\nWhat all these organizations have in common is a balanced investment across the alert lifecycle, which doesn't neglect their SOC.\n\nThis article examines how investing in the SOC is indispensable for organizations that have already allocated significant resources to detection tools. Additionally, a balanced SOC investment is crucial for maximizing the value of their existing detection investments.\n\nUnderstanding this fundamental disconnect explains how security gaps arise:\n\nDetection tools operate in milliseconds.They must make instant decisions on millions of signals every day. They have no time for nuance; speed is essential. Without it, networks would come to a halt, as every email, file, and connection request would be held up for analysis.\n\nDetection tools zoom in.They are the first to identify and isolate potential threats, but they lack an understanding of the bigger picture. Meanwhile, SOC teams operate with a 30K feet view. When alerts reach analysts, they have something detection tools lack: time and context.\n\nConsequently, the SOC tackles alerts from a different perspective:\n\nFirst, it can make it more difficult for executive leadership to identify the root of the problem. CISOs and budget holders in organizations that deploy various detection tools often assume their investments will keep them safe. Meanwhile, the SOC experiences this differently, overwhelmed by noise and lacking the resources to properly investigate real threats. Because detection spending is obvious, while SOC struggles happen behind closed doors, security leaders find it challenging to demonstrate the need for additional investment in their SOC.\n\nSecond, the asymmetry overwhelms the last line of defense. Significant investments in multiple detection tools produce thousands of alerts that flood the SOC every day. With underfunded SOCs, analysts become goalies facing hundreds of shots at once, forced to make split-second decisions under immense pressure.\n\nThird, it undermines the ability to identify nuanced threats. When the SOC is overwhelmed by alerts, the capacity for detailed investigative work is lost. The threats that escape detection are the ones that detection tools would never catch in the first place.\n\nWhen detection tools generate hundreds of alerts daily, adding a few more SOC analysts is as effective as trying to save a sinking ship with a bucket. The traditional alternative has beenoutsourcing to MSSPs or MDRsand assigning external teams to handle overflow.\n\nBut for many, the trade-offs are still too much: high ongoing costs, shallow analyst investigations that are unfamiliar with your environment, delays in coordination, and broken communication. Outsourcing doesn't fix the imbalance; it just shifts the burden onto someone else's plate.\n\nToday, AI SOC platforms are becoming the preferred choice for organizations with lean SOC teams looking for an efficient, cost-effective, and scalable solution. AI SOC platforms operate at the investigation layer where contextual reasoning happens, automate alert triage, and surface only high-fidelity incidents after assigning them context.\n\nWith the help of AI SOC, analysts save hundreds of hours each month, as false-positive rates often drop by more than 90%. This automated coverage enables small internal teams to provide 24/7 coverage without additional staffing or outsourcing. The companies featured in this case study invested in this approach through Radiant Security, an agentic AI SOC platform.\n\nMost security teams have the opportunity to allocate resources to maximize ROI from their current detection investments, support future growth, and enhance protection. Organizations that invest in detection tools but neglect their SOC create blind spots and burnout.\n\nRadiant Security, the agentic AI SOC platform highlighted in the case study, shows success through balanced security investment. Radiant works at the SOC investigation layer, automatically triaging every alert, cutting false positives by about 90%, and analyzing threats at machine speed, like a top analyst. With over 100 integrations with existing security tools and one-click response features, Radiant helps lean security teams investigate any alert, known or unknown, without needing impossible headcount increases. Radiant security makes enterprise-grade SOC capabilities available to organizations of any size.",
        "tags": [
            {
                "name": "SOC (Security Operations Center)",
                "confidence": 1.0
            },
            {
                "name": "Detection Tools",
                "confidence": 0.9
            },
            {
                "name": "AI SOC Platforms",
                "confidence": 0.95
            },
            {
                "name": "Phishing Attack",
                "confidence": 0.8
            },
            {
                "name": "Alert Lifecycle",
                "confidence": 0.8
            },
            {
                "name": "Security Investment Asymmetry",
                "confidence": 0.9
            },
            {
                "name": "Balanced Security Investment",
                "confidence": 0.9
            },
            {
                "name": "False Positives",
                "confidence": 0.85
            },
            {
                "name": "Alert Triage",
                "confidence": 0.8
            },
            {
                "name": "Radiant Security",
                "confidence": 0.9
            },
            {
                "name": "Email Security Tools",
                "confidence": 0.7
            },
            {
                "name": "Threats",
                "confidence": 0.6
            },
            {
                "name": "Security Gaps",
                "confidence": 0.7
            },
            {
                "name": "SOC Analysts",
                "confidence": 0.7
            },
            {
                "name": "Contextual Reasoning",
                "confidence": 0.7
            },
            {
                "name": "Outsourcing",
                "confidence": 0.6
            },
            {
                "name": "MSSPs (Managed Security Service Providers)",
                "confidence": 0.5
            },
            {
                "name": "MDRs (Managed Detection and Response)",
                "confidence": 0.5
            },
            {
                "name": "CISOs (Chief Information Security Officers)",
                "confidence": 0.5
            },
            {
                "name": "Investigative Work",
                "confidence": 0.6
            },
            {
                "name": "Burnout",
                "confidence": 0.6
            },
            {
                "name": "24/7 Coverage",
                "confidence": 0.5
            },
            {
                "name": "High-fidelity Incidents",
                "confidence": 0.6
            },
            {
                "name": "Agentic AI SOC Platform",
                "confidence": 0.7
            },
            {
                "name": "Underfunded SOCs",
                "confidence": 0.7
            },
            {
                "name": "Noise (Security Alerts)",
                "confidence": 0.6
            },
            {
                "name": "Enterprise-grade SOC capabilities",
                "confidence": 0.6
            },
            {
                "name": "Security Leaders",
                "confidence": 0.5
            },
            {
                "name": "C-suite Executives",
                "confidence": 0.4
            }
        ],
        "scraped_at": "2025-11-29T11:34:02.597621"
    },
    {
        "title": "Qilin Ransomware Turns South Korean MSP Breach Into 28-Victim 'Korean Leaks' Data Heist",
        "url": "https://thehackernews.com/2025/11/qilin-ransomware-turns-south-korean-msp.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgZLFjSSfGkqSN0_JR2Bn3chbdA6ZWeRT-TPvVWvosbR8gqrvxxpndEARBl7kUES8N1hVSuPYweHiF2E3FOCb6VgM5rCmBkzWQTvFABAgr4EaFZ99Z6R9uDzJmPDhfnSCRt33hnJf8gca0PP0jIBg0mnv-Q1jTHV1HfQqQ2ScEBDqZxE4iKXguQtM_VXB77/s790-rw-e365/raas.jpg",
        "description": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware.  \"This operation combined the capabilities of a major Ransomware-as-a-Service (RaaS) group, Qilin, with potential involvement from North Korean state-affiliated actors (Moonstone Sleet), leveraging Managed Service Provider (MSP) compromise as the initial access vector,\" Bitdefender said  in a report shared with The Hacker News.  Qilin has emerged as one of the most active ransomware operations this year, with the RaaS crew exhibiting \"explosive growth\" in the month of October 2025 by claiming  over 180 victims . The group is responsible for 29% of all ransomware attacks, per data from NCC Group .  The Romanian cybersecurity company said it decided to dig deeper after uncovering an unusual spike  in ransomware victims from South Korea in September 2025, when it became the second-most affected countr...",
        "content": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware.\n\n\"This operation combined the capabilities of a major Ransomware-as-a-Service (RaaS) group, Qilin, with potential involvement from North Korean state-affiliated actors (Moonstone Sleet), leveraging Managed Service Provider (MSP) compromise as the initial access vector,\" Bitdefendersaidin a report shared with The Hacker News.\n\nQilin has emerged as one of the most active ransomware operations this year, with the RaaS crew exhibiting \"explosive growth\" in the month of October 2025 byclaimingover180 victims. The group is responsible for 29% of all ransomware attacks, per data fromNCC Group.\n\nThe Romanian cybersecurity company said it decided to dig deeper after uncovering anunusual spikein ransomware victims from South Korea in September 2025, when it became the second-most affected country by ransomware after the U.S., with 25 cases, a significant jump from an average of about 2 victims per month between September 2024 and August 2025.\n\nFurther analysis found that all 25 cases were attributed exclusively to the Qilin ransomware group, with 24 of the victims in the financial sector. The campaign was given the monikerKorean Leaksby the attackers themselves.\n\nWhile Qilin's origins are likely Russian, the threat actors self-identify as \"political activists\" and \"patriots of the country.\" It follows a traditional affiliate model, which involves recruiting a diverse group of hackers to carry out the attacks in return for taking a small share of up to 20% of the illicit payments.\n\nOne particular affiliate of note is a North Korean state-sponsored actor tracked asMoonstone Sleet, which, according to Microsoft, has deployed a custom ransomware variant called FakePenny in an attack targeting an unnamed defense technology company in April 2024.\n\nThen, earlier this February, a significant pivot occurred when the adversary wasobserveddelivering Qilin ransomware at a limited number of organizations. While it's not exactly clear if the latest set of attacks was indeed carried out by the hacking group, the targeting of South Korean businesses aligns with its strategic objectives.\n\nKorean Leaks took place over three publication waves, resulting in the theft of over 1 million files and 2 TB of data from 28 victims. Victim posts associated with four other entities were removed from the data leak site (DLS), suggesting that they may have been taken down either following ransom negotiations or a unique internal policy, Bitdefender said.\n\nThe three waves are as follows -\n\nAn unusual aspect about these leaks is the departure from established tactics of exerting pressure on compromised organizations, instead leaning heavily on propaganda and political language.\n\n\"The entire campaign was framed as a public-service effort to expose systemic corruption, exemplified by the threats to release files that could be 'evidence of stock market manipulation' and names of 'well-known politicians and businessmen in Korea,'\" Bitdefender said of the first wave of the campaign.\n\nSubsequent waves went on to escalate the threat a notch higher, claiming that the leak of the data could pose a severe risk to the Korean financial market. The actors also called on South Korean authorities to investigate the case, citing stringent data protection laws.\n\nA further shift in messaging was observed in the third wave, where the group initially continued the same theme of a national financial crisis resulting from the release of stolen information, but then switched to a language that \"more closely resembled Qilin's typical, financially motivated extortion messages.\"\n\nGiven that Qilinboastsof an \"in-house team of journalists\" to help affiliates with writing texts for blog posts and help apply pressure during negotiations, it's assessed that the group's core members were behind the publication of the DLS text.\n\n\"The posts contain several of the core operator's signature grammatical inconsistencies,\" Bitdefender said. \"However, this control over the final draft does not mean the affiliate was excluded from having a critical say in the key messaging or overall direction of the content.\"\n\nTo pull off these attacks, the Qilin affiliate is said to have breached a single upstream managed service provider (MSP), leveraging the access to compromise several victims at once. On September 23, 2025, the Korea JoongAng Dailyreportedthat more than 20 asset management companies in the country were infected with ransomware following the compromise of GJTec.\n\nTo mitigate these risks, it's essential that organizations enforce Multi-Factor Authentication (MFA), apply the Principle of Least Privilege (PoLP) to restrict access, segment critical systems and sensitive data, and take proactive steps to reduce attack surfaces.\n\n\"The MSP compromise that triggered the 'Korean Leaks' operation highlights a critical blind spot in cybersecurity discussions,\" Bitdefender said. \"Exploiting a vendor, contractor, or MSP that has access to other businesses is a more prevalent and practical route that RaaS groups seeking clustered victims can take.\"",
        "tags": [
            {
                "name": "Qilin ransomware",
                "confidence": 1.0
            },
            {
                "name": "South Korea",
                "confidence": 0.95
            },
            {
                "name": "MSP compromise",
                "confidence": 0.9
            },
            {
                "name": "Korean Leaks",
                "confidence": 0.9
            },
            {
                "name": "Supply chain attack",
                "confidence": 0.85
            },
            {
                "name": "Financial sector",
                "confidence": 0.8
            },
            {
                "name": "Ransomware-as-a-Service (RaaS)",
                "confidence": 0.8
            },
            {
                "name": "Moonstone Sleet",
                "confidence": 0.75
            },
            {
                "name": "North Korean state-affiliated actors",
                "confidence": 0.7
            },
            {
                "name": "Propaganda",
                "confidence": 0.7
            },
            {
                "name": "Data Heist",
                "confidence": 0.7
            },
            {
                "name": "Data Leak Site (DLS)",
                "confidence": 0.65
            },
            {
                "name": "Political language",
                "confidence": 0.65
            },
            {
                "name": "GJTec",
                "confidence": 0.6
            },
            {
                "name": "Extortion",
                "confidence": 0.6
            },
            {
                "name": "Affiliate model",
                "confidence": 0.6
            },
            {
                "name": "Multi-Factor Authentication (MFA)",
                "confidence": 0.5
            },
            {
                "name": "Principle of Least Privilege (PoLP)",
                "confidence": 0.5
            },
            {
                "name": "System segmentation",
                "confidence": 0.45
            },
            {
                "name": "Attack surface reduction",
                "confidence": 0.45
            },
            {
                "name": "FakePenny ransomware",
                "confidence": 0.4
            },
            {
                "name": "Data protection laws",
                "confidence": 0.4
            },
            {
                "name": "Managed Service Provider (MSP)",
                "confidence": 0.4
            },
            {
                "name": "Initial access vector",
                "confidence": 0.4
            },
            {
                "name": "Russia",
                "confidence": 0.3
            },
            {
                "name": "Bitdefender",
                "confidence": 0.3
            }
        ],
        "scraped_at": "2025-11-29T11:33:37.617984"
    },
    {
        "title": "Shai-Hulud v2 Spreads From npm to Maven, as Campaign Exposes Thousands of Secrets",
        "url": "https://thehackernews.com/2025/11/shai-hulud-v2-campaign-spreads-from-npm.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEghgyXKKmEGWfIkqMuka-PLw6Jrl_bPx6Ptub1wNLhbJpyZDfQbTvmYfoV1wzIKc6af7Axp-KlbkHDgadFI6P1iWAe0g8xbyEmKAZazSUZ1aleKTfRgxF7DOs9yhNmlvQGZWvn8-ovkMv7hy0HBlWjOHFHKGOD1uvLMa-L_ZxRxyCsBrk7w0kL7uGH0idaj/s790-rw-e365/marven-hack.jpg",
        "description": "The second wave of the Shai-Hulud supply chain attack  has spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry.  The Socket Research Team said it identified a Maven Central package named org.mvnpm:posthog-node:4.18.1 that embeds the same two components associated with Sha1-Hulud: the \"setup_bun.js\" loader and the main payload \"bun_environment.js.\" The company told The Hacker News that org.mvnpm:posthog-node:4.18.1 was the only Java package identified so far.  \"This means the PostHog project has compromised releases in both the JavaScript/npm and Java/Maven ecosystems, driven by the same Shai Hulud v2 payload,\" the cybersecurity company said  in a Tuesday update.  It's worth noting that the Maven Central package is not published by PostHog itself. Rather, the \"org.mvnpm\" coordinates  are generated via an automated mvnpm process  that rebuilds npm packages as Maven artifacts. The Maven Central said...",
        "content": "The second wave of theShai-Hulud supply chain attackhas spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry.\n\nThe Socket Research Team said it identified a Maven Central package named org.mvnpm:posthog-node:4.18.1 that embeds the same two components associated with Sha1-Hulud: the \"setup_bun.js\" loader and the main payload \"bun_environment.js.\" The company told The Hacker News that org.mvnpm:posthog-node:4.18.1 was the only Java package identified so far.\n\n\"This means the PostHog project has compromised releases in both the JavaScript/npm and Java/Maven ecosystems, driven by the same Shai Hulud v2 payload,\" the cybersecurity companysaidin a Tuesday update.\n\nIt's worth noting that the Maven Central package is not published by PostHog itself. Rather, the \"org.mvnpm\"coordinatesare generated via an automatedmvnpm processthat rebuilds npm packages as Maven artifacts. The Maven Central said they are working to implement extra protections to prevent already known compromised npm components from being rebundled. As of November 25, 2025, 22:44 UTC, all mirrored copies have been purged.\n\nThe development comes as the \"second coming\" of the supply chain incident hastargeteddevelopers globally with an aim to steal sensitive data like API keys, cloud credentials, and npm and GitHub tokens, and facilitate deeper supply chain compromise in a worm-like fashion. The latest iteration has also evolved to be more stealthy, aggressive, scalable, and destructive.\n\nBesides borrowing the overall infection chain of the initial September variant, theattackallows threat actors to gain unauthorized access to npm maintainer accounts and publish trojanized versions of their packages. When unsuspecting developers download and run these libraries, the embedded malicious code backdoors their own machines and scans for secrets and exfiltrates them to GitHub repositories using the stolen tokens.\n\nTheattackaccomplishes this by injectingtwo rogue workflows, one of which registers the victim machine as a self-hosted runner and enables arbitrary command execution whenever a GitHub Discussion is opened. A second workflow is designed to systematically harvest all secrets. Over 28,000 repositories have been affected by the incident.\n\n\"This version significantly enhances stealth by utilizing the Bun runtime to hide its core logic and increases its potential scale by raising the infection cap from 20 to 100 packages,\" Cycode's Ronen Slavin and Roni Kuznickisaid. \"It also uses a new evasion technique, exfiltrating stolen data to randomly named public GitHub repositories instead of a single, hard-coded one.\"\n\nThe attacks illustrate how trivial it is for attackers to take advantage of trusted software distribution pathways to push malicious versions at scale and compromise thousands of downstream developers. What's more, the self-replication nature of the malware means a single infected account is enough to amplify the blast radius of the attack and turn it into awidespread outbreakin a short span of time.\n\nFurther analysis by Aikido hasuncoveredthat the threat actors exploited vulnerabilities, specifically focusing on CI misconfigurations in pull_request_target and workflow_run workflows, in existing GitHub Actions workflows to pull off the attack and compromise projects associated with AsyncAPI, PostHog, and Postman.\n\nThe vulnerability \"used the risky pull_request_target trigger in a way that allowed code supplied by any new pull request to be executed during the CI run,\" security researcher Ilyas Makari said. \"A single misconfiguration can turn a repository into a patient zero for a fast-spreading attack, giving an adversary the ability to push malicious code through automated pipelines you rely on every day.\"\n\nIt's assessed that the activity is the continuation of a broader set of attacks targeting the ecosystem that commenced with the August 2025S1ngularity campaignimpacting several Nx packages on npm.\n\n\"As a new and significantly more aggressive wave of npm supply chain malware, Shai-Hulud 2 combines stealthy execution, credential breadth, and fallback destructive behavior, making it one of the most impactful supply chain attacks of the year,\" Nadav Sharkazy, a product manager atApiiro, said in a statement.\n\n\"This malware shows how a single compromise in a popular library can cascade into thousands of downstream applications by trojanizing legitimate packages during installation.\"\n\nData compiled byGitGuardian,OX Security, and Wiz shows that the campaign has leaked hundreds of GitHub access tokens and credentials associated with Amazon Web Services (AWS), Google Cloud, and Microsoft Azure. More than 5,000 files were uploaded to GitHub with the exfiltrated secrets. GitGuardian's analysis of 4,645 GitHub repositories has identified 11,858 unique secrets, out of which 2,298 remained valid and publicly exposed as of November 24, 2025.\n\nUsers areadvisedto rotate all tokens and keys, audit all dependencies, remove compromised versions, reinstall clean packages, and harden developer and CI/CD environments with least-privilege access, secret scanning, and automated policy enforcement.\n\n\"Sha1-Hulud is another reminder that the modern software supply chain is still way too easy to break,\" Dan Lorenc, co-founder and CEO of Chainguard, said. \"A single compromised maintainer and a malicious install script is all it takes to ripple through thousands of downstream projects in a matter of hours.\"\n\n\"The techniques attackers are using are constantly evolving. Most of these attacks don't rely on zero-days. They exploit the gaps in how open source software is published, packaged, and pulled into production systems. The only real defense is changing the way software gets built and consumed.\"",
        "tags": [
            {
                "name": "Shai-Hulud v2",
                "confidence": 1.0
            },
            {
                "name": "npm",
                "confidence": 1.0
            },
            {
                "name": "Maven",
                "confidence": 0.9
            },
            {
                "name": "Software Supply Chain Attack",
                "confidence": 1.0
            },
            {
                "name": "Secrets Exfiltration",
                "confidence": 1.0
            },
            {
                "name": "GitHub",
                "confidence": 0.9
            },
            {
                "name": "GitHub Actions",
                "confidence": 0.9
            },
            {
                "name": "CI/CD Security",
                "confidence": 0.9
            },
            {
                "name": "API Keys",
                "confidence": 0.9
            },
            {
                "name": "Cloud Credentials",
                "confidence": 0.9
            },
            {
                "name": "npm Tokens",
                "confidence": 0.9
            },
            {
                "name": "GitHub Tokens",
                "confidence": 0.9
            },
            {
                "name": "Bun Runtime",
                "confidence": 0.8
            },
            {
                "name": "CI Misconfigurations",
                "confidence": 0.8
            },
            {
                "name": "Trojanized Packages",
                "confidence": 0.8
            },
            {
                "name": "Self-hosted Runner",
                "confidence": 0.8
            },
            {
                "name": "pull_request_target",
                "confidence": 0.7
            },
            {
                "name": "Amazon Web Services (AWS)",
                "confidence": 0.7
            },
            {
                "name": "Google Cloud",
                "confidence": 0.7
            },
            {
                "name": "Microsoft Azure",
                "confidence": 0.7
            },
            {
                "name": "Secret Scanning",
                "confidence": 0.7
            },
            {
                "name": "JavaScript Ecosystem",
                "confidence": 0.6
            },
            {
                "name": "Java Ecosystem",
                "confidence": 0.6
            },
            {
                "name": "workflow_run",
                "confidence": 0.6
            },
            {
                "name": "Least-Privilege Access",
                "confidence": 0.6
            },
            {
                "name": "S1ngularity Campaign",
                "confidence": 0.5
            },
            {
                "name": "PostHog",
                "confidence": 0.5
            },
            {
                "name": "mvnpm process",
                "confidence": 0.5
            },
            {
                "name": "Open Source Software",
                "confidence": 0.5
            },
            {
                "name": "Developers",
                "confidence": 0.5
            },
            {
                "name": "Rotate Tokens",
                "confidence": 0.5
            },
            {
                "name": "Audit Dependencies",
                "confidence": 0.5
            },
            {
                "name": "Automated Policy Enforcement",
                "confidence": 0.5
            },
            {
                "name": "Socket Research Team",
                "confidence": 0.4
            },
            {
                "name": "Cycode",
                "confidence": 0.4
            },
            {
                "name": "Aikido",
                "confidence": 0.4
            },
            {
                "name": "GitGuardian",
                "confidence": 0.4
            },
            {
                "name": "OX Security",
                "confidence": 0.4
            },
            {
                "name": "Wiz",
                "confidence": 0.4
            },
            {
                "name": "AsyncAPI",
                "confidence": 0.4
            },
            {
                "name": "Postman",
                "confidence": 0.4
            },
            {
                "name": "Apiiro",
                "confidence": 0.3
            },
            {
                "name": "Chainguard",
                "confidence": 0.3
            }
        ],
        "scraped_at": "2025-11-29T11:33:23.506982"
    },
    {
        "title": "Gainsight Expands Impacted Customer List Following Salesforce Security Alert",
        "url": "https://thehackernews.com/2025/11/gainsight-expands-impacted-customer.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhLmTJUwBQylR2JxQKyRPwiaWc6Ia-71wvno8Z5H4N6-8KX7WBGjZLU2ONRBc4Qd7vpIOcWXWkcrekIsNcFhS75LB7IwPMOvGMQPY3xe2yl0qPlgoly_1tEdy99a_glYDj599U0nR2KHQoBkgx49tGys8tsIT_hosQpkSZsiLSXCUFJkCCDWn26eg_jxMpd/s790-rw-e365/sales.jpg",
        "description": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought.  The company said  Salesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list\" as of November 21, 2025. It did not reveal the exact number of customers who were impacted, but its CEO, Chuck Ganapathi, said  \"we presently know of only a handful of customers who had their data affected.\"  The development comes as Salesforce warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform, prompting the company to revoke all access and refresh tokens associated with them. The breach has been claimed by a notorious cybercrime group known as ShinyHunters (aka Bling Libra).  A number of other precautionary steps have been enacted to contain the incident. This includes Zendesk, Gong.io, and HubSpot temporarily suspending their Gainsight...",
        "content": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought.\n\nThe companysaidSalesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list\" as of November 21, 2025. It did not reveal the exact number of customers who were impacted, but its CEO, Chuck Ganapathi,said\"we presently know of only a handful of customers who had their data affected.\"\n\nThe development comes as Salesforce warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform, prompting the company to revoke all access and refresh tokens associated with them. The breach has been claimed by a notorious cybercrime group known as ShinyHunters (aka Bling Libra).\n\nA number of other precautionary steps have been enacted to contain the incident. This includes Zendesk, Gong.io, and HubSpot temporarily suspending their Gainsight integrations, and Google disabling OAuth clients with callback URIs like gainsightcloud[.]com. HubSpot, in its own advisory,saidit found no evidence to suggest any compromise of its own infrastructure or customers.\n\nIn an FAQ, Gainsight has also listed the products for which the ability to read and write from Salesforce has been temporarily unavailable -\n\nThe company, however, emphasized that Staircase is not affected by the incident and that Salesforce removed the Staircase connection out of caution in response to an ongoing investigation.\n\nBoth Salesforce and Gainsight have published indicators of compromise (IoCs) associated with the breach, with one user agent string, \"Salesforce-Multi-Org-Fetcher/1.0\", used for unauthorized access, also flagged as previously employed in the Salesloft Drift activity.\n\nAccording toinformationfrom Salesforce, reconnaissance efforts against customers with compromised Gainsight access tokens were first recorded from the IP address \"3.239.45[.]43\" on October 23, 2025, followed by subsequent waves of reconnaissance and unauthorized access starting November 8.\n\nTo further secure their environments, customers are asked to follow the steps below -\n\n\"These steps are preventative in nature and are designed to ensure your environment remains secure while the investigation continues,\" Gainsight said.\n\nThe development comes against the backdrop of a new ransomware-as-a-service (RaaS) platform calledShinySp1d3r(also spelled Sh1nySp1d3r) that's being developed by Scattered Spider, LAPSUS$, and ShinyHunters (SLSH). Data from ZeroFox has revealed that the cybercriminal alliance has been responsible for at least 51 cyberattacks over the past year.\n\n\"While the ShinySp1d3r encryptor has some features common to other encryptors, it also boasts features that have never been seen before in the RaaS space,\" the company said.\n\n\"These include: Hooking the EtwEventWrite function to prevent Windows Event Viewer logging, terminating processes that keep files open – which would normally prevent encryption – by iterating over processes before killing them, [and] filling free space in a drive by writing random data contained in a .tmp file, likely to overwrite any deleted files.\"\n\nShinySp1d3r also comes with the ability tosearchfor open network shares and encrypt them, as well as propagate to other devices on the local network through deployViaSCM, deployViaWMI, and attemptGPODeployment.\n\nIn a report published Wednesday, independent cybersecurity journalist Brian Krebssaidthe individual responsible for releasing the ransomware is a core SLSH member named \"Rey\" (aka@ReyXBF), who is also one of the three administrators of the group's Telegram channel. Rey was previously an administrator ofBreachForumsand the data leak website forHellCat ransomware.\n\nRey, whose identity has been unmasked as Saif Al-Din Khader, told Krebs that ShinySp1d3r is a rehash of HellCat that has been modified with artificial intelligence (AI) tools and that he has been cooperating with law enforcement since at least June 2025.\n\n\"The emergence of a RaaS program, in conjunction with an EaaS [extortion-as-a-service] offering, makes SLSH a formidable adversary in terms of the wide net they can cast against organizations using multiple methods to monetize their intrusion operations,\" Palo Alto Networks Unit 42 researcher Matt Bradysaid. \"Additionally, theinsider recruitmentelement adds yet another layer for organizations to defend against.\"",
        "tags": [
            {
                "name": "Gainsight",
                "confidence": 0.9
            },
            {
                "name": "Salesforce",
                "confidence": 0.9
            },
            {
                "name": "Security Alert",
                "confidence": 0.9
            },
            {
                "name": "Data Breach",
                "confidence": 0.9
            },
            {
                "name": "Customer Data",
                "confidence": 0.8
            },
            {
                "name": "ShinyHunters",
                "confidence": 0.9
            },
            {
                "name": "Bling Libra",
                "confidence": 0.8
            },
            {
                "name": "Access Tokens",
                "confidence": 0.9
            },
            {
                "name": "Refresh Tokens",
                "confidence": 0.9
            },
            {
                "name": "OAuth clients",
                "confidence": 0.8
            },
            {
                "name": "Indicators of Compromise (IoCs)",
                "confidence": 0.9
            },
            {
                "name": "Unauthorized Access",
                "confidence": 0.9
            },
            {
                "name": "Reconnaissance",
                "confidence": 0.8
            },
            {
                "name": "Ransomware-as-a-Service (RaaS)",
                "confidence": 0.95
            },
            {
                "name": "ShinySp1d3r",
                "confidence": 0.95
            },
            {
                "name": "Sh1nySp1d3r",
                "confidence": 0.9
            },
            {
                "name": "Scattered Spider",
                "confidence": 0.9
            },
            {
                "name": "LAPSUS$",
                "confidence": 0.9
            },
            {
                "name": "SLSH",
                "confidence": 0.9
            },
            {
                "name": "Cyberattacks",
                "confidence": 0.9
            },
            {
                "name": "Encryptor",
                "confidence": 0.8
            },
            {
                "name": "File Encryption",
                "confidence": 0.8
            },
            {
                "name": "HellCat ransomware",
                "confidence": 0.8
            },
            {
                "name": "Extortion-as-a-Service (EaaS)",
                "confidence": 0.8
            },
            {
                "name": "Insider Recruitment",
                "confidence": 0.8
            },
            {
                "name": "Security",
                "confidence": 0.9
            },
            {
                "name": "Intrusion Operations",
                "confidence": 0.8
            },
            {
                "name": "Suspicious Activity",
                "confidence": 0.7
            },
            {
                "name": "Zendesk",
                "confidence": 0.5
            },
            {
                "name": "Gong.io",
                "confidence": 0.5
            },
            {
                "name": "HubSpot",
                "confidence": 0.5
            },
            {
                "name": "Google",
                "confidence": 0.5
            },
            {
                "name": "Integrations",
                "confidence": 0.7
            },
            {
                "name": "Investigation",
                "confidence": 0.6
            },
            {
                "name": "User Agent String",
                "confidence": 0.6
            },
            {
                "name": "Salesloft Drift activity",
                "confidence": 0.5
            },
            {
                "name": "IP address",
                "confidence": 0.6
            },
            {
                "name": "Preventative Steps",
                "confidence": 0.6
            },
            {
                "name": "EtwEventWrite function",
                "confidence": 0.5
            },
            {
                "name": "Windows Event Viewer logging",
                "confidence": 0.5
            },
            {
                "name": "Network Shares",
                "confidence": 0.6
            },
            {
                "name": "Propagation",
                "confidence": 0.6
            },
            {
                "name": "Rey",
                "confidence": 0.6
            },
            {
                "name": "Artificial Intelligence (AI) tools",
                "confidence": 0.6
            },
            {
                "name": "Ransomware",
                "confidence": 0.95
            },
            {
                "name": "Palo Alto Networks",
                "confidence": 0.2
            },
            {
                "name": "Brian Krebs",
                "confidence": 0.2
            },
            {
                "name": "BreachForums",
                "confidence": 0.3
            }
        ],
        "scraped_at": "2025-11-29T11:33:04.249655"
    },
    {
        "title": "ThreatsDay Bulletin: AI Malware, Voice Bot Flaws, Crypto Laundering, IoT Attacks — and 20 More Stories",
        "url": "https://thehackernews.com/2025/11/threatsday-bulletin-ai-malware-voice.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEht6UhaJKO8B5nl8PUBMTiIxKg_F2ZG2IyUHemsnutwdvUzAoD9LKGyJje58Z40uNuSorotRXHqJPcfW40M1TIoUn9Ncv1wRhCIq5s3jpjvJcCOs-4LHwbUMjYDCLNQXYw_C9ARz65Zk6i9812SiRSL8HoCAhdJJw8H2-pMVQo0xzHPexyOkcZU4ZI59O1E/s790-rw-e365/threatsday.jpg",
        "description": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there's a lot happening in the cyber world.  Criminals are getting creative — using smart tricks to steal data, sound real, and hide in plain sight. But they're not the only ones moving fast. Governments and security teams are fighting back, shutting down fake networks, banning risky projects, and tightening digital defenses.  Here's a quick look at what's making waves this week — the biggest hacks, the new threats, and the wins worth knowing about.                   Mirai-based malware resurfaces with new IoT campaign             ShadowV2 Botnet Continues to Target IoT Devices                  The threat actors behind the Mirai-based ShadowV2  botnet have been observed infecting IoT devices across industries and continents. The campaign is said to have been active only during the Amazon Web Services (AWS) outage  in late October 2025. It's assessed ...",
        "content": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there's a lot happening in the cyber world.\n\nCriminals are getting creative — using smart tricks to steal data, sound real, and hide in plain sight. But they're not the only ones moving fast. Governments and security teams are fighting back, shutting down fake networks, banning risky projects, and tightening digital defenses.\n\nHere's a quick look at what's making waves this week — the biggest hacks, the new threats, and the wins worth knowing about.\n\n\n\nThe threat actors behind the Mirai-basedShadowV2botnet have been observed infecting IoT devices across industries and continents. The campaign is said to have been active only during the Amazon Web Services (AWS)outagein late October 2025. It's assessed that the activity was \"likely a test run conducted in preparation for future attacks,\" perFortinet. The botnet exploited several flaws, includingCVE-2009-2765(DDWRT),CVE-2020-25506,CVE-2022-37055,CVE-2024-10914,CVE-2024-10915(D-Link),CVE-2023-52163(DigiEver),CVE-2024-3721(TBK), andCVE-2024-53375(TP-Link), to recruit susceptible gear into a zombie army of IoT devices. A successful exploitation is followed by the execution of a downloader shell script that delivers the ShadowV2 malware for subsequent DDoS attacks. \"IoT devices remain a weak link in the broader cybersecurity landscape,\" the company said. \"The evolution of ShadowV2 suggests a strategic shift in the targeting behavior of threat actors toward IoT environments.\" It's not just ShadowV2. Another DDoS botnet namedRondoDox, also based on Mirai, has weaponized over a dozen exploits to target IoT devices. \"Attackers are not only motivated to target vulnerable IoT devices, but also how, if successful, they will take over previously infected devices to add them to their own botnets,\" F5said.\n\nSingapore has ordered Apple and Google to block or filter messages on iMessage and RCS-supported Messages app for Android that masquerade as government agencies, requiring the company to implement new anti-spoofing protections starting December 2025 as part of efforts to curb rising online scams. According toStraits Times, Apple has been issued a directive under the Online Criminal Harms Act, requiring the tech giant to prevent iMessage accounts and group chats from using names that mimic Singapore government agencies or the \"gov.sg\" sender ID.\n\nThe developers behind the Tor project are preparing a major upgrade called Counter Galois Onion (CGO), which replaces the long-standing relay encryption method used across the anonymity network. \"It's based on a kind of construction called a Rugged Pseudorandom Permutation (RPRP): essentially, it's a design for a wide-block cipher that resists malleability in one direction (for the encrypt operation, but not the decrypt operation),\" the Tor Projectsaid. \"If we deploy this so that clients always decrypt and relays always encrypt, then we have a tagging-resistant cipher at less cost than a full SPRP [strong pseudorandom permutation]!\" The updates aim to raise the cost of active attacks along a circuit, such as tagging and traffic-interception attacks, as well as prevent bad actors from tampering with encrypted traffic, add forward secrecy, and make the network more resilient.\n\nKasperskysaidit identified nearly 6.4 million phishing attacks, which targeted users of online stores, payment systems, and banks in the first ten months of 2025. \"As many as 48.2% of these attacks were directed at online shoppers,\" it said, adding it \"detected more than 2 million phishing attacks related to online gaming\" and \"blocked more than 146,000 Black Friday-themed spam messages in the first two weeks of November.\"\n\nESET has disclosed details of a new toolset dubbed QuietEnvelope that's specifically developed to target the MailGates email protection system of OpenFind email servers. The toolset comprises Perl scripts and three stealthy backdoors, among other miscellaneous files. \"The Perl scripts are mainly responsible for deploying three passive backdoors as a loadable kernel module (LKM), an Apache module, and an injected shellcode,\" ESETsaid. \"Together, they enable the attackers to have remote access to a compromised server.\" The LKM component (\"smtp_backdoor\") monitors ingress TCP traffic on port 6400 and triggers when packets contain the magic string EXEC_OPENFIND to execute the command. \"The Apache module expects the command, which is executed via popen, in the custom HTTP header OpenfindMaster,\" it added. \"The third backdoor is injected into a running mgsmtpd process. It is capable of retrieving file content and executing commands. By default, it responds with 250 OK, suggesting that the backdoor is hooked into the code that is maybe responsible for generating the SMTP response.\" The tool is believed to be the work of an unknown state-sponsored threat actor, given the sophistication and its ability to blend in. ESET said it found debug strings written in simplified Chinese, which is mainly used in Mainland China.\n\nA Bing search for \"belay\" leads to the website \"belaysolutions[.]com,\" which is said to have been compromised with malicious JavaScript that performs a silent redirect to \"belaysolutions[.]link\" that hosts a double-extension RAR payload disguised as a PDF. Opening the initial payload exploitsMSC EvilTwin(CVE-2025-26633) to inject code into mmc.exe, ultimately leading to the deployment of a loader executable that's capable of installing backdoors or stealers. \"When run, mmc.exe resolves MUI paths that load the malicious snap-in instead of the legitimate one, triggering embedded TaskPad commands with an encoded PowerShell payload,\" Zscalersaid. \"Decoded via -EncodedCommand, this script downloads UnRAR[.]exe and a password-protected RAR, extracts the next stage, waits briefly, then Invoke-Expression on the extracted script.\" The second script displays a decoy PDF and downloads and executes the loader binary. The exact nature of the payload is unclear due to the fact that the command-and-control (C2) infrastructure is unresponsive. The attack chain has been attributed to a Russia-aligned APT group known as Water Gamayun (aka EncryptHub).\n\nThe U.K. has exposed two companies, Smart and TGR, which laundered money from cybercrime, drugs trade, firearms smuggling, and immigration crime for a fee, to create \"clean\" cryptocurrency that the Russian state could then use to evade international sanctions. The National Crime Agency (NCA) said the two entities acquired a bank in Kyrgyzstan to pose as legitimate operations. The network is known to operate in at least 28 U.K. cities and towns. \"Smart and TGR collaborated to launder money for transnational crime groups involved in cybercrime, drugs, and firearms smuggling,\" the NCAsaid. \"They also helped their Russian clients to illegally bypass financial restrictions to invest money in the U.K., threatening the integrity of our economy.\"\n\nMicrosoft said it has updated Defender for Office 365 to help security teams remove calendar entries automatically created by Outlook during email delivery. While remediation actions such as Move to Junk, Delete, Soft Delete, and Hard Delete can be used to eliminate email threats from users' inboxes, the actions did not touch the calendar entry created by the original invite. \"With this update, we're taking the first step toward closing that gap,\" the companysaid. \"Hard Delete will now also remove the associated calendar entry for any meeting invite email. This ensures threats are fully eradicated—not just from the inbox but also from the calendar—reducing the risk of user interaction with malicious content.\"\n\nData regulators in Thailand have orderedTIDC Worldverse, which presents the Sam Altman-founded startup, Tools for Humanity, in the country, tostop the collectionof iris biometrics in exchange for World (formerly Worldcoin) cryptocurrency payments. It has also demanded the deletion of biometric data already collected from 1.2 million Thai citizens. The project has witnessed similar bans in Brazil, the Philippines, Indonesia, and Kenya.\n\nTimur Kilin, a 21-year-old tech entrepreneur and cybersecurity specialist, wasarrestedin Moscow ontreason chargeslate last week. While the details of the case are unknown, it's suspected that Kilin may have attracted the attention of authorities after criticizing the state-backed messaging app Max and the government's anti-cybercrime legislation.\n\nThreat actors associated with the Smishing Triad have expanded their focus to target Egypt by setting up malicious domains impersonating major Egyptian service providers, including Fawry, the Egypt Post, and Careem. The Smishing Triad is a Chinese-speaking cybercriminal group specializing in large-scale smishing campaigns across the world using a phishing kit named Panda. \"Beyond U.S. service impersonation, the smishing kit offers a wide range of international templates, including those that mimic prominent ISPs such as Du (U.A.E.),\" Dark Atlassaid. \"These templates are designed to harvest PII from victims across different regions, significantly expanding the campaign's global reach.\" Recently, Googlefiled a civil lawsuitin the U.S. District Court for the Southern District of New York (SDNY) against a massive Phishing-as-a-Service (PhaaS) platform called Lighthouse that has ensnared over 1 million users across 120 countries. Lighthouse is one of the PhaaS services used by the Smishing Triad. The PhaaS kits are primarily distributed through Telegram by a threat actor named Wang Duo Yu (@wangduoyu8).\n\nMozilla hasannouncedplans to shut down Monitor Plus, a service that allowed user data to be removed from data broker portals. The service will wind down on December 17, 2025. It was offered through a partnership with Onerep, a controversial company whose Belarusian CEO, Dimitiri Shelest, wascaughtrunning dozens of people search engine services since 2010. \"Mozilla Monitor's free monitoring service will continue to provide real-time alerts and step-by-step guides to mitigate the risks of a data breach,\" Mozilla said.\n\nA new threat actor named NetMedved is targeting Russian companies with phishing emails containing ZIP archives that include a LNK file masquerading as a purchase request, along with other decoy documents. Opening the LNK file triggers a multi-stage infection sequence that drops NetSupport RAT. The activity, perPositive Technologies, was observed in mid-October 2025. The development comes as F6detailednew attacks mounted by VasyGrek (akaFluffy Wolf), a Russian-speaking e-crime actor known for striking Russian companies since 2016 to deliver remote access trojans (RATs) and stealer malware. The latest set of attacks recorded between August and November 2025 involved the use of the Pay2Key ransomware, as well as malware developed byPureCoder, including PureCrypter, PureHVNC, and PureLogs Stealer.\n\nThreat actors are using legitimate websites compromised with malicious JavaScript injects to serve site visitors fake CAPTCHA checks that contain a Base64-encoded payload to display aClickFixlure that's appropriate for the operating system by using theEtherHidingtechnique. This involves hiding intermediate JavaScript payloads on the blockchain and using four smart contracts deployed on the Binance Smart Chain (BSC) to ensure that the victim is not a bot and direct them to an operating system (OS)-specific contract. However, the OS-specific JavaScript is delivered only after a call to a gate contract that responds either \"yes\" or another value. \"This gate provides the attacker with a remotely controlled feature flag,\" Censyssaid. \"By altering on-chain state, the operator can selectively enable or disable delivery for specific victims, throttle execution, or temporarily disable the entire campaign.\" The payloads distributed throughout chains include common stealers like AMOS and Vidar. Similar drive-by compromise attacks have also been found to display counterfeit CAPTCHA verifications that leverage the ClickFix tactic to drop Lumma Stealer, according toNCC Group.\n\nMicrosoft said the PhaaS toolkit known as Tycoon 2FA (aka Storm-1747) has emerged as the most prolific platform observed by the company this year. In October 2025 alone, Microsoft Defender for Office 365 blocked more than 13 million malicious emails linked to Tycoon 2FA. \"More than 44% of all CAPTCHA-gated phishing attacks blocked by Microsoft were attributed to Tycoon 2FA,\" itsaid. \"Tycoon2FA was also directly linked to nearly 25% of all QR code phishing attacks detected in October.\" First discovered in 2023, Tycoon 2FA has evolved into a potent tool that leverages real-time Adversary-in-the-Middle (AitM) techniques to capture credentials, steal session tokens, and one-time codes. \"The platform delivers high-fidelity phishing pages for Microsoft 365, Gmail, and Outlook, and has become a preferred tool among threat actors due to its subscription-based, low-barrier operational model,\" CYFIRMAsaid.\n\nA new version of Xillen Stealer has introduced advanced features to evade AI-based detection systems by mimicking legitimate users and adjusting CPU and memory usage to imitate normal apps. Its main goal is to steal credentials, cryptocurrency, and sensitive data across browsers, password managers, and cloud environments. It's marketed on Telegram for anywhere between $99 to $599 per month. The latest iteration also includes code to use AI to detect high-value targets based on weighted indicators and relevant keywords defined in a dictionary. These include cryptocurrency wallets, banking data, premium accounts, developer accounts, and business emails, along with location indicators that include high-value countries such as the U.S., the U.K., Germany, and Japan, and other cryptocurrency-friendly countries and financial hubs. While the feature is not fully implemented by its authors, Xillen Killers, the development shows how threat actors could be leveraging AI in future campaigns, Darktracesaid.\n\nThe Federal Communications Commission (FCC) has scrapped a set of telecom cybersecurity rules introduced after the Salt Typhoon espionage campaign came to light last year to prevent state-sponsored hackers from breaching American carriers. The ruling cameinto effectin January 2025. The course reversal comes after what the FCC said were \"extensive, urgent, and coordinated efforts\" from carriers to mitigate operational risks and better protect consumers. The action follows \"months-long engagement with communications service providers where they have demonstrated a strengthened cybersecurity posture following Salt Typhoon,\" the agencyadded, adding it has \"taken a series of actions to harden communications networks and improve their security posture to enhance the agency's investigative process into communications networks outages that result from cyber incidents.\" This included establishing aCouncil on National Securityand adopting rules to address cybersecurity risks to critical communications infrastructure without \"imposing inflexible and ambiguous requirements.\" However, the FCC's announcement offers no details on how those improvements will be monitored or enforced.\n\nTwo British teenagers who were charged with Computer Misuse Act offenses over a cyber attack on Transport for London (TfL) last yearpleaded not guiltyduring a court appearance last week. Thalha Jubair, 19, and Owen Flowers, 18, werearrestedat their homes in East London and Walsall, respectively, by officers from the National Crime Agency (NCA) in September 2025.\n\nA security vulnerability has been disclosed in theRetell AI API, which creates AI voice agents that have excessive permissions and functionality. This stems from a lack of sufficient guardrails that causes its large language model (LLM) to deliver unintended outputs. An attacker could exploit this behavior to stage large-scale social engineering, phishing, and misinformation campaigns. \"The vulnerability targets Retell AI's ease of deployment and customizability to perform scalable phishing/social engineering attacks,\" the CERT Coordination Center (CERT/CC)said. \"Attackers can feed publicly available resources as well as some instructions to Retell AI's API to generate high-volume and automated fake calls. These fake calls could lead to unauthorized actions, security breaches, data leaks, and other forms of manipulation.\" The issue remains unpatched.\n\nA new analysis from Kaspersky has revealed that the dark web continues to serve as a parallel labor market with its own rules, recruitment practices, and salary expectations, while also being influenced by current economic forces. \"The majority of job seekers do not specify a professional field, with 69% expressing willingness to take any available work,\" the companysaid. \"At the same time, a wide range of roles are represented, particularly in IT. Developers, penetration testers, and money launderers remain the most in-demand specialists, with reverse engineers commanding the highest average salaries. We also observe a significant presence of teenagers in the market, many seeking small, fast earnings and often already familiar with fraudulent schemes.\"\n\nAhnLabsaidit discovered an Android APK malware (\"com.golfpang.golfpanggolfpang\") impersonating a famous Korean delivery service, while taking steps to evade security controls using obfuscation and packing techniques. The data stolen by the malware is exfiltrated to a breached legitimate site that's used for C2. \"When the app is launched, it requests the permissions required to perform malicious behaviors from the user,\" AhnLab said. In a similar development, a malicious programdisguisedasSteamCleaneris being propagated via websites that advertise cracked software to deliver a Node.js script capable of communicating with a C2 server periodically and executing commands issued by the attacker. While it's not known what commands are sent via the C2 channel, AhnLab said the activity could lead to theinstallationofproxywareand other payloads. The counterfeit installers are hosted on GitHub repositories managed by the threat actor.\n\nDirector-General of Security Mike Burgess, the head of Australia's Security Intelligence Organisation (ASIO),disclosedthat threat actors operating on behalf of China's government and military probed the country's telecoms network and key infrastructure. Burgess warned that authoritarian regimes \"are growing more willing to disrupt or destroy critical infrastructure\" using cyber sabotage. Espionage is estimated to have cost the country A$12.5 billion ($8.1 billion) in 2024. However, China has dismissed the remarks, stating they \"spread false narratives and deliberately provoked confrontation.\"\n\nAlice Guo, a 35-year-old Chinese woman who posed as a local and was elected as mayor for the city of Bamban in 2022, wassentenced to life in prisonafter she was found guilty of human trafficking for her role in running a hugecyber scam compoundthat was operating under online casinos, known locally as Philippine Offshore Gaming Operations (Pogo). Guo, along with three others, was sentenced to life in prison and a fine of 2 million pesos ($33,832).\n\nMultiple vulnerabilities in Microsoft Windows have been exploited by threat actors to leak NTLM hashes and augment their post-exploitation efforts. These includeCVE-2024-43451, which has been abused by BlindEagle and Head Mare,CVE-2025-24054, which has been abused in phishing attacks targeting Russia to deliver Warzone RAT, andCVE-2025-33073, which has been abused in \"suspicious activity\" against an unnamed target belonging to the financial sector in Uzbekistan. In this attack, the threat actor exploited the flaw to check if they had sufficient privileges to execute code using batch files that ran reconnaissance commands, establish persistence, dump LSASS memory, and unsuccessfully attempt to move laterally to the administrative share of another host. No further activity was detected. \"While Microsoft has announced plans to phase it out, the protocol's pervasive presence across legacy systems and enterprise networks keeps it relevant and vulnerable,\" Kasperskysaid. \"Threat actors are actively leveraging newly disclosed flaws to refine credential relay attacks, escalate privileges, and move laterally within networks, underscoring that NTLM still represents a major security liability.\"\n\n\n\nThat's a wrap for this week's ThreatsDay. The big picture? Cybercrime is getting faster, smarter, and harder to spot — but awareness still beats panic. Keep your software updated, stay alert for anything that feels off, and don't click in a hurry. The more we all stay sharp, the harder it gets for attackers to win.",
        "tags": [
            {
                "name": "AI Malware",
                "confidence": 0.9
            },
            {
                "name": "Voice Bot Flaws",
                "confidence": 0.9
            },
            {
                "name": "Crypto Laundering",
                "confidence": 1.0
            },
            {
                "name": "IoT Attacks",
                "confidence": 1.0
            },
            {
                "name": "Cybercrime",
                "confidence": 1.0
            },
            {
                "name": "Scams",
                "confidence": 0.8
            },
            {
                "name": "Data Theft",
                "confidence": 0.7
            },
            {
                "name": "Digital Defenses",
                "confidence": 0.6
            },
            {
                "name": "Mirai Botnet",
                "confidence": 0.8
            },
            {
                "name": "ShadowV2 Botnet",
                "confidence": 0.9
            },
            {
                "name": "Botnet",
                "confidence": 0.9
            },
            {
                "name": "DDoS Attacks",
                "confidence": 0.9
            },
            {
                "name": "RondoDox Botnet",
                "confidence": 0.7
            },
            {
                "name": "Anti-spoofing",
                "confidence": 0.8
            },
            {
                "name": "Online Scams",
                "confidence": 0.8
            },
            {
                "name": "Tor Network",
                "confidence": 0.9
            },
            {
                "name": "Anonymity Network",
                "confidence": 0.8
            },
            {
                "name": "Encryption",
                "confidence": 0.8
            },
            {
                "name": "Forward Secrecy",
                "confidence": 0.7
            },
            {
                "name": "Phishing",
                "confidence": 1.0
            },
            {
                "name": "Spam",
                "confidence": 0.5
            },
            {
                "name": "QuietEnvelope Toolset",
                "confidence": 0.9
            },
            {
                "name": "Backdoors",
                "confidence": 0.9
            },
            {
                "name": "Remote Access",
                "confidence": 0.8
            },
            {
                "name": "State-sponsored Threat Actor",
                "confidence": 0.8
            },
            {
                "name": "Malicious JavaScript",
                "confidence": 0.8
            },
            {
                "name": "Silent Redirect",
                "confidence": 0.7
            },
            {
                "name": "Code Injection",
                "confidence": 0.7
            },
            {
                "name": "Loader Malware",
                "confidence": 0.7
            },
            {
                "name": "Stealer Malware",
                "confidence": 0.9
            },
            {
                "name": "Command and Control (C2)",
                "confidence": 0.8
            },
            {
                "name": "APT Group",
                "confidence": 0.8
            },
            {
                "name": "Water Gamayun (EncryptHub)",
                "confidence": 0.8
            },
            {
                "name": "Money Laundering",
                "confidence": 1.0
            },
            {
                "name": "Cryptocurrency",
                "confidence": 1.0
            },
            {
                "name": "International Sanctions Evasion",
                "confidence": 0.8
            },
            {
                "name": "Email Threats",
                "confidence": 0.7
            },
            {
                "name": "Iris Biometrics",
                "confidence": 0.9
            },
            {
                "name": "Worldcoin",
                "confidence": 0.9
            },
            {
                "name": "Data Collection",
                "confidence": 0.8
            },
            {
                "name": "Data Deletion",
                "confidence": 0.8
            },
            {
                "name": "Smishing",
                "confidence": 1.0
            },
            {
                "name": "Impersonation",
                "confidence": 0.8
            },
            {
                "name": "Phishing Kit",
                "confidence": 0.8
            },
            {
                "name": "PII Theft",
                "confidence": 0.7
            },
            {
                "name": "Phishing-as-a-Service (PhaaS)",
                "confidence": 0.9
            },
            {
                "name": "Lighthouse PhaaS",
                "confidence": 0.8
            },
            {
                "name": "Data Broker Portals",
                "confidence": 0.8
            },
            {
                "name": "Data Removal",
                "confidence": 0.8
            },
            {
                "name": "NetMedved",
                "confidence": 0.8
            },
            {
                "name": "VasyGrek (Fluffy Wolf)",
                "confidence": 0.8
            },
            {
                "name": "Remote Access Trojans (RATs)",
                "confidence": 0.9
            },
            {
                "name": "Ransomware",
                "confidence": 0.8
            },
            {
                "name": "Pay2Key Ransomware",
                "confidence": 0.8
            },
            {
                "name": "EtherHiding Technique",
                "confidence": 0.9
            },
            {
                "name": "Blockchain",
                "confidence": 0.8
            },
            {
                "name": "Smart Contracts",
                "confidence": 0.8
            },
            {
                "name": "Drive-by Compromise",
                "confidence": 0.8
            },
            {
                "name": "Tycoon 2FA (Storm-1747)",
                "confidence": 0.9
            },
            {
                "name": "Adversary-in-the-Middle (AitM)",
                "confidence": 0.9
            },
            {
                "name": "Credential Theft",
                "confidence": 0.9
            },
            {
                "name": "Session Tokens",
                "confidence": 0.8
            },
            {
                "name": "One-time Codes",
                "confidence": 0.8
            },
            {
                "name": "Xillen Stealer",
                "confidence": 0.9
            },
            {
                "name": "AI-based Detection Evasion",
                "confidence": 0.9
            },
            {
                "name": "AI in Malware",
                "confidence": 1.0
            },
            {
                "name": "Cryptocurrency Theft",
                "confidence": 0.9
            },
            {
                "name": "Sensitive Data Theft",
                "confidence": 0.8
            },
            {
                "name": "Telecom Cybersecurity",
                "confidence": 0.8
            },
            {
                "name": "State-sponsored Hackers",
                "confidence": 0.8
            },
            {
                "name": "Critical Infrastructure",
                "confidence": 0.8
            },
            {
                "name": "Cyber Sabotage",
                "confidence": 0.9
            },
            {
                "name": "Espionage",
                "confidence": 1.0
            },
            {
                "name": "Computer Misuse Act",
                "confidence": 0.6
            },
            {
                "name": "Cyber Attack",
                "confidence": 0.8
            },
            {
                "name": "AI Voice Agents",
                "confidence": 0.9
            },
            {
                "name": "LLM Vulnerabilities",
                "confidence": 0.9
            },
            {
                "name": "Social Engineering",
                "confidence": 0.9
            },
            {
                "name": "Misinformation Campaigns",
                "confidence": 0.9
            },
            {
                "name": "Dark Web",
                "confidence": 1.0
            },
            {
                "name": "Fraudulent Schemes",
                "confidence": 0.7
            },
            {
                "name": "Android Malware",
                "confidence": 0.9
            },
            {
                "name": "Obfuscation",
                "confidence": 0.8
            },
            {
                "name": "Packing Techniques",
                "confidence": 0.8
            },
            {
                "name": "Data Exfiltration",
                "confidence": 0.8
            },
            {
                "name": "Proxyware",
                "confidence": 0.8
            },
            {
                "name": "Human Trafficking",
                "confidence": 0.9
            },
            {
                "name": "Cyber Scam Compound",
                "confidence": 0.9
            },
            {
                "name": "Microsoft Windows Vulnerabilities",
                "confidence": 0.9
            },
            {
                "name": "NTLM Hashes",
                "confidence": 0.9
            },
            {
                "name": "Post-exploitation",
                "confidence": 0.8
            },
            {
                "name": "Lateral Movement",
                "confidence": 0.8
            },
            {
                "name": "Credential Relay Attacks",
                "confidence": 0.9
            },
            {
                "name": "Privilege Escalation",
                "confidence": 0.9
            },
            {
                "name": "Software Updates",
                "confidence": 0.7
            },
            {
                "name": "User Awareness",
                "confidence": 0.8
            },
            {
                "name": "Vulnerabilities",
                "confidence": 0.9
            },
            {
                "name": "CVE-2009-2765",
                "confidence": 0.7
            },
            {
                "name": "CVE-2020-25506",
                "confidence": 0.7
            },
            {
                "name": "CVE-2022-37055",
                "confidence": 0.7
            },
            {
                "name": "CVE-2024-10914",
                "confidence": 0.7
            },
            {
                "name": "CVE-2024-10915",
                "confidence": 0.7
            },
            {
                "name": "CVE-2023-52163",
                "confidence": 0.7
            },
            {
                "name": "CVE-2024-3721",
                "confidence": 0.7
            },
            {
                "name": "CVE-2024-53375",
                "confidence": 0.7
            },
            {
                "name": "CVE-2025-26633 (MSC EvilTwin)",
                "confidence": 0.7
            },
            {
                "name": "CVE-2024-43451",
                "confidence": 0.7
            },
            {
                "name": "CVE-2025-24054",
                "confidence": 0.7
            },
            {
                "name": "CVE-2025-33073",
                "confidence": 0.7
            },
            {
                "name": "IoT Devices",
                "confidence": 1.0
            },
            {
                "name": "Apple",
                "confidence": 0.6
            },
            {
                "name": "Google",
                "confidence": 0.6
            },
            {
                "name": "iMessage",
                "confidence": 0.6
            },
            {
                "name": "RCS",
                "confidence": 0.6
            },
            {
                "name": "Android",
                "confidence": 0.6
            },
            {
                "name": "MailGates",
                "confidence": 0.6
            },
            {
                "name": "OpenFind",
                "confidence": 0.6
            },
            {
                "name": "Perl Scripts",
                "confidence": 0.6
            },
            {
                "name": "Loadable Kernel Module (LKM)",
                "confidence": 0.7
            },
            {
                "name": "Apache Module",
                "confidence": 0.7
            },
            {
                "name": "PowerShell",
                "confidence": 0.6
            },
            {
                "name": "Microsoft Defender for Office 365",
                "confidence": 0.8
            },
            {
                "name": "Outlook",
                "confidence": 0.7
            },
            {
                "name": "Telegram",
                "confidence": 0.6
            },
            {
                "name": "GitHub",
                "confidence": 0.5
            },
            {
                "name": "Node.js",
                "confidence": 0.6
            },
            {
                "name": "Microsoft Windows",
                "confidence": 0.9
            },
            {
                "name": "Large Language Model (LLM)",
                "confidence": 0.9
            },
            {
                "name": "Binance Smart Chain (BSC)",
                "confidence": 0.7
            }
        ],
        "scraped_at": "2025-11-29T11:32:43.160571"
    },
    {
        "title": "Webinar: Learn to Spot Risks and Patch Safely with Community-Maintained Tools",
        "url": "https://thehackernews.com/2025/11/webinar-learn-to-spot-risks-and-patch.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEghRvtVjaxNU0fdaFSozjGWEs_xWQjuyBRppTXjPMmjqojoEybF1sK13Xy3B0saOYldj1zfh_G7lNNTKBfZ_m9o7R9ImfAkgcRlCbVeaoYEWHz0DDTB5gIGT7SNYTWAIqVQOevNUIKb6lRW7wJ3ou0TZ64cnxGAd5RgbEfy1cxxcOGRJldJInloOOhVbKu2/s790-rw-e365/update.jpg",
        "description": "If you're using community tools like Chocolatey or Winget to keep systems updated, you're not alone. These platforms are fast, flexible, and easy to work with—making them favorites for IT teams. But there's a catch...  The very tools that make your job easier might also be the reason your systems are at risk.  These tools are run by the community. That means anyone can add or update packages. Some packages may be old, missing safety checks, or changed by mistake or on purpose. Hackers look for these weak spots. This has already happened in places like NPM and PyPI. The same risks can happen with Windows tools too.  To help you patch safely without slowing down, there's a free webinar coming up . It's led by Gene Moody, Field CTO at Action1 . He'll walk through how these tools work, where the risks are, and how to protect your systems while keeping updates on track.  In this session, he'll test how safe these tools really are. You'll get practical steps you can use right away—n...",
        "content": "If you're using community tools likeChocolateyorWingetto keep systems updated, you're not alone. These platforms are fast, flexible, and easy to work with—making them favorites for IT teams. But there's a catch...\n\nThe very tools that make your job easier might also be the reason your systems are at risk.\n\nThese tools are run by the community. That means anyone can add or update packages. Some packages may be old, missing safety checks, or changed by mistake or on purpose. Hackers look for these weak spots. This has already happened in places like NPM and PyPI. The same risks can happen with Windows tools too.\n\nTo help you patch safely without slowing down,there's a free webinar coming up. It's led by Gene Moody, Field CTO atAction1. He'll walk through how these tools work, where the risks are, and how to protect your systems while keeping updates on track.\n\nIn this session, he'll test how safe these tools really are. You'll get practical steps you can use right away—nothing theoretical, just what works.\n\nThe goal is not to scare you away from community tools. They're useful. But they need guardrails—rules that help you use them safely without slowing you down.\n\nYou will learn:\n\n🔒 How to spot hidden risks\n\n⚙️ How to set safety checks like source pinning, allow-lists, and hash/signature verification\n\n📊 How to prioritize updates using known vulnerability data (KEV)\n\n📦 How to choose between community tools, direct vendor sources, or a mix of both\n\nIf you're not sure when to use community repos and when to go straight to the vendor, this session will help you decide. You'll also see how to mix both in a safe way.\n\nThis webinar is for anyone who manages software updates—whether you're on a small team or a large one. If you've ever wondered what's really inside that next patch, this session is for you.\n\nIt's free to attend, and you'll leave with clear actions you can apply the same day.Save your spot here.",
        "tags": [
            {
                "name": "Community tools",
                "confidence": 1.0
            },
            {
                "name": "Chocolatey",
                "confidence": 0.95
            },
            {
                "name": "Winget",
                "confidence": 0.95
            },
            {
                "name": "Patching",
                "confidence": 0.95
            },
            {
                "name": "Risks",
                "confidence": 0.95
            },
            {
                "name": "Supply chain security",
                "confidence": 0.95
            },
            {
                "name": "Software updates",
                "confidence": 0.9
            },
            {
                "name": "Vulnerability management",
                "confidence": 0.9
            },
            {
                "name": "Webinar",
                "confidence": 0.9
            },
            {
                "name": "Safety checks",
                "confidence": 0.9
            },
            {
                "name": "Prioritize updates",
                "confidence": 0.9
            },
            {
                "name": "NPM",
                "confidence": 0.85
            },
            {
                "name": "PyPI",
                "confidence": 0.85
            },
            {
                "name": "Source pinning",
                "confidence": 0.85
            },
            {
                "name": "Allow-lists",
                "confidence": 0.85
            },
            {
                "name": "Hash verification",
                "confidence": 0.85
            },
            {
                "name": "Signature verification",
                "confidence": 0.85
            },
            {
                "name": "Known Vulnerability Data (KEV)",
                "confidence": 0.85
            },
            {
                "name": "Packages",
                "confidence": 0.85
            },
            {
                "name": "Hackers",
                "confidence": 0.8
            },
            {
                "name": "Action1",
                "confidence": 0.8
            },
            {
                "name": "Vendor sources",
                "confidence": 0.8
            },
            {
                "name": "Windows tools",
                "confidence": 0.7
            }
        ],
        "scraped_at": "2025-11-29T11:31:49.316595"
    },
    {
        "title": "Microsoft to Block Unauthorized Scripts in Entra ID Logins with 2026 CSP Update",
        "url": "https://thehackernews.com/2025/11/microsoft-to-block-unauthorized-scripts.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEggbH_BZ4IWtK9XUQJlVK_lYU-KRFB6bMqJMGZUr640ws6tiDaAcew4Pf9SC_Mc3aUrTo52vkVQ2OGUXwZ1y9M0jRb0mywWeYspEWQ2QyjaRfWz1Z8jTDn1HzsNL87aEZRvaEvsuEzCx0DG4CAGMUbazLVxKSLjPpNh255KfuycID8w7BgOm445sOl4cZt0/s790-rw-e365/entra-id.jpg",
        "description": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now.  The update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"login.microsoftonline[.]com\" by only letting scripts from trusted Microsoft domains run.  \"This update strengthens security and adds an extra layer of protection by allowing only scripts from trusted Microsoft domains to run during authentication, blocking unauthorized or injected code from executing during the sign-in experience,\" the Windows maker said .  Specifically, it only allows script downloads from Microsoft trusted CDN domains and inline script execution from a Microsoft trusted source. The updated policy is limited to browser-based sign-in experiences for URLs beginning with login.microsoftonline.com. Microsoft Entra External ID will not be affected.   The change, which has been described as a proacti...",
        "content": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now.\n\nThe update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"login.microsoftonline[.]com\" by only letting scripts from trusted Microsoft domains run.\n\n\"This update strengthens security and adds an extra layer of protection by allowing only scripts from trusted Microsoft domains to run during authentication, blocking unauthorized or injected code from executing during the sign-in experience,\" the Windows makersaid.\n\nSpecifically, it only allows script downloads from Microsoft trusted CDN domains and inline script execution from a Microsoft trusted source. The updated policy is limited to browser-based sign-in experiences for URLs beginning with login.microsoftonline.com. Microsoft Entra External ID will not be affected.\n\nThe change, which has been described as a proactive measure, is part of Microsoft's Secure Future Initiative (SFI) and is designed to safeguard users against cross-site scripting (XSS) attacks that make it possible to inject malicious code into websites. It's expected to be rolled out globally starting mid-to-late October 2026.\n\nMicrosoft is urging organizations to test their sign-in flows thoroughly ahead of time to ensure that there are no issues and the sign-in experience has no friction.\n\nIt's also advising customers to refrain from using browser extensions or tools that inject code or script into the Microsoft Entra sign-in experience. Those who follow this approach are recommended to switch to other tools that don't inject code.\n\nTo identify any CSP violations, users can go through a sign-in flow with the dev console open and access the browser's Console tool within the developer tools to check for errors that say \"Refused to load the script\" for going against the \"script-src\" and \"nonce\" directives.\n\nMicrosoft's SFI is a multi-year effort that seeks to put security above all else when designing new products and better prepare for the growing sophistication of cyber threats.\n\nIt was first launched in November 2023 and expanded in May 2024 following a report from the U.S. Cyber Safety Review Board (CSRB), whichconcludedthat the company's \"security culture was inadequate and requires an overhaul.\"\n\nIn itsthird progress reportpublished this month, the tech giant said it has deployed over 50 new detections in its infrastructure to target high-priority tactics, techniques, and procedures, and that the adoption of phishing-resistant multi-factor authentication (MFA) for users and devices has hit 99.6%.\n\nOther notable changes enacted by Microsoft are as follows -\n\n\"To align with Zero Trust principles, organizations should automate vulnerability detection, response, and remediation using integrated security tools and threat intelligence,\" Microsoft said. \"Maintaining real-time visibility into security incidents across hybrid and cloud environments enables faster containment and recovery.\"",
        "tags": [
            {
                "name": "Microsoft",
                "confidence": 1.0
            },
            {
                "name": "Entra ID",
                "confidence": 1.0
            },
            {
                "name": "Content Security Policy (CSP)",
                "confidence": 1.0
            },
            {
                "name": "Script Injection Attacks",
                "confidence": 0.95
            },
            {
                "name": "Cross-site scripting (XSS)",
                "confidence": 0.95
            },
            {
                "name": "Security",
                "confidence": 0.9
            },
            {
                "name": "Authentication",
                "confidence": 0.9
            },
            {
                "name": "Secure Future Initiative (SFI)",
                "confidence": 0.85
            },
            {
                "name": "Malicious code",
                "confidence": 0.8
            },
            {
                "name": "Zero Trust principles",
                "confidence": 0.8
            },
            {
                "name": "Cyber threats",
                "confidence": 0.8
            },
            {
                "name": "CSP violations",
                "confidence": 0.7
            },
            {
                "name": "script-src directive",
                "confidence": 0.7
            },
            {
                "name": "nonce directive",
                "confidence": 0.7
            },
            {
                "name": "login.microsoftonline.com",
                "confidence": 0.6
            },
            {
                "name": "Trusted Microsoft domains",
                "confidence": 0.6
            },
            {
                "name": "Multi-factor authentication (MFA)",
                "confidence": 0.6
            },
            {
                "name": "Phishing",
                "confidence": 0.55
            },
            {
                "name": "Browser extensions",
                "confidence": 0.5
            },
            {
                "name": "CDN (Content Delivery Network)",
                "confidence": 0.5
            },
            {
                "name": "Microsoft Entra External ID",
                "confidence": 0.5
            },
            {
                "name": "Developer tools",
                "confidence": 0.45
            },
            {
                "name": "U.S. Cyber Safety Review Board (CSRB)",
                "confidence": 0.4
            },
            {
                "name": "Security culture",
                "confidence": 0.4
            },
            {
                "name": "Tactics, techniques, and procedures (TTPs)",
                "confidence": 0.4
            },
            {
                "name": "Vulnerability detection",
                "confidence": 0.4
            },
            {
                "name": "Threat intelligence",
                "confidence": 0.4
            }
        ],
        "scraped_at": "2025-11-29T11:31:36.827815"
    },
    {
        "title": "The Practical Playbook for Secure AI Adoption",
        "url": "https://thehackernews.uk/practical-ai-security",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhIqT2haMtEYZ1q_0Ga3bxf3brI9YcZvuu8K9xaabU18OuC68AWp5CoukISz_n1tv9XObC4wnWxKIuffN6vQu8DqR1X_1iowMDgv0ToAVUm_-NMR01h5umjlKsT1h0FvacqlBm3uSL_hISt2K0rQLhLifoB-C3gwLw2KSwEPdHcnd9PKn9Rv2AXfEVm_UTw/s450-rw-e100/wing.png",
        "description": "Your guide to discover, monitor, and govern AI across your organization.",
        "content": "",
        "tags": [],
        "scraped_at": "2025-11-29T11:31:15.752835"
    },
    {
        "title": "Bloody Wolf Expands Java-based NetSupport RAT Attacks in Kyrgyzstan and Uzbekistan",
        "url": "https://thehackernews.com/2025/11/bloody-wolf-expands-java-based.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjF1NjcNl0amY7zxe4zJ58EcQQ7cm-HPNA2F3qrnTLAeF1lyBNGx1SvEnmz0Ok5DUV8ZRiOZP0fDBf_tP0LIZRcShjLexQJ6nbXiQsFaBEXc8bSHuTmGjKGscfYjGahNnvbk7Vf0hmdHX5Gca9LrWUwPwIl10Q5qzaPbH6BNHIJNg1s79QJ4BMLD4z6hhN3/s790-rw-e365/gib.jpg",
        "description": "The threat actor known as Bloody Wolf  has been attributed to a cyber attack campaign that has targeted Kyrgyzstan since at least June 2025 with the goal of delivering NetSupport RAT.  As of October 2025, the activity has expanded to also single out Uzbekistan, Group-IB researchers Amirbek Kurbanov and Volen Kayo said in a report published in collaboration with Ukuk, a state enterprise under the Prosecutor General's office of the Kyrgyz Republic. The attacks have targeted finance, government, and information technology (IT) sectors.  \"Those threat actors would impersonate the [Kyrgyzstan's] Ministry of Justice through official looking PDF documents and domain names, which in turn hosted malicious Java Archive (JAR) files designed to deploy the NetSupport RAT,\" the Singapore-headquartered company said .  \"This combination of social engineering and accessible tooling allows Bloody Wolf to remain effective while keeping a low operational profile.\"   Bloody Wol...",
        "content": "The threat actor known asBloody Wolfhas been attributed to a cyber attack campaign that has targeted Kyrgyzstan since at least June 2025 with the goal of delivering NetSupport RAT.\n\nAs of October 2025, the activity has expanded to also single out Uzbekistan, Group-IB researchers Amirbek Kurbanov and Volen Kayo said in a report published in collaboration with Ukuk, a state enterprise under the Prosecutor General's office of the Kyrgyz Republic. The attacks have targeted finance, government, and information technology (IT) sectors.\n\n\"Those threat actors would impersonate the [Kyrgyzstan's] Ministry of Justice through official looking PDF documents and domain names, which in turn hosted malicious Java Archive (JAR) files designed to deploy the NetSupport RAT,\" the Singapore-headquartered companysaid.\n\n\"This combination of social engineering and accessible tooling allows Bloody Wolf to remain effective while keeping a low operational profile.\"\n\nBloody Wolfis the name assigned to ahacking groupof unknown provenance that has used spear-phishing attacks to target entities in Kazakhstan and Russia using tools like STRRAT and NetSupport. The group is assessed to be active since at least late 2023.\n\nThe targeting of Kyrgyzstan and Uzbekistan using similar initial access techniques marks an expansion of the threat actor's operations in Central Asia, primarily impersonating trusted government ministries in phishing emails to distribute weaponized links or attachments.\n\nThe attack chains more or less follow the same approach in that the message recipients are tricked into clicking on links that download malicious Java archive (JAR) loader files along with instructions to install Java Runtime.\n\nWhile the email claims the installation is necessary to view the documents, the reality is that it's used to execute the loader. Once launched, the loader then proceeds to fetch the next-stage payload (i.e., NetSupport RAT) from infrastructure that's under the attacker's control and set up persistence in three ways -\n\nThe Uzbekistan phase of the campaign is notable for incorporating geofencing restrictions, thereby causing requests originating outside of the country to be redirected to the legitimate data.egov[.]uz website. Requests from within Uzbekistan have been found to trigger the download of the JAR file from an embedded link within the PDF attachment.\n\nGroup-IB said the JAR loaders observed in the campaigns are built with Java 8, which was released in March 2014. It's believed that the attackers are using a bespoke JAR generator or template to spawn these artifacts. The NetSupport RAT payload is a old version of NetSupport Manager from October 2013.\n\n\"Bloody Wolf has demonstrated how low-cost, commercially available tools can be weaponized into sophisticated, regionally targeted cyber operations,\" it said. \"By exploiting trust in government institutions and leveraging simple JAR-based loaders, the group continues to maintain a strong foothold across the Central Asian threat landscape.\"",
        "tags": [
            {
                "name": "Bloody Wolf",
                "confidence": 0.95
            },
            {
                "name": "NetSupport RAT",
                "confidence": 0.95
            },
            {
                "name": "Kyrgyzstan",
                "confidence": 0.9
            },
            {
                "name": "Uzbekistan",
                "confidence": 0.9
            },
            {
                "name": "Java",
                "confidence": 0.9
            },
            {
                "name": "JAR files",
                "confidence": 0.9
            },
            {
                "name": "Spear-phishing",
                "confidence": 0.9
            },
            {
                "name": "Social engineering",
                "confidence": 0.8
            },
            {
                "name": "RAT (Remote Access Trojan)",
                "confidence": 0.8
            },
            {
                "name": "Group-IB",
                "confidence": 0.8
            },
            {
                "name": "Central Asia",
                "confidence": 0.8
            },
            {
                "name": "Threat actor",
                "confidence": 0.8
            },
            {
                "name": "Cyber attack campaign",
                "confidence": 0.8
            },
            {
                "name": "Phishing emails",
                "confidence": 0.8
            },
            {
                "name": "Government sector",
                "confidence": 0.7
            },
            {
                "name": "Finance sector",
                "confidence": 0.7
            },
            {
                "name": "Information technology (IT) sector",
                "confidence": 0.7
            },
            {
                "name": "Ministry of Justice",
                "confidence": 0.7
            },
            {
                "name": "Geofencing",
                "confidence": 0.7
            },
            {
                "name": "PDF documents",
                "confidence": 0.7
            },
            {
                "name": "Persistence",
                "confidence": 0.7
            },
            {
                "name": "Java Runtime",
                "confidence": 0.7
            },
            {
                "name": "Ukuk",
                "confidence": 0.7
            },
            {
                "name": "Kazakhstan",
                "confidence": 0.6
            },
            {
                "name": "Russia",
                "confidence": 0.6
            },
            {
                "name": "NetSupport Manager",
                "confidence": 0.6
            },
            {
                "name": "STRRAT",
                "confidence": 0.4
            }
        ],
        "scraped_at": "2025-11-29T11:31:12.250414"
    },
    {
        "title": "MS Teams Guest Access Can Remove Defender Protection When Users Join External Tenants",
        "url": "https://thehackernews.com/2025/11/ms-teams-guest-access-can-remove.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg_Md0lsjItddYFH1gCm6LZYxVDobM4ZWOweikeQFAT0yZNSYS8WKfg61LxSRjc49watAPtqESgvWx0UwppGQuw9FU8OMQDf9EOi1fWnVXF_H8L7QNOplD1-vdDAO-oU4cRg9CX2jky45M7SkmAF6b7GGi7UwMZQN4_7wnlG2D1mYl28_sUC7hLta8u37Oa/s790-rw-e365/msteams.jpg",
        "description": "Cybersecurity researchers have shed light on a cross-tenant blind spot that allows attackers to bypass Microsoft Defender for Office 365 protections via the guest access  feature in Teams.  \"When users operate as guests in another tenant, their protections are determined entirely by that hosting environment, not by their home organization,\" Ontinue security researcher Rhys Downing said  in a report.  \"These advancements increase collaboration opportunities, but they also widen the responsibility for ensuring those external environments are trustworthy and properly secured.\"  The development comes as Microsoft has begun rolling out a new feature in Teams that allows users to chat with anyone via email, including those who don't use the enterprise communications platform, starting this month. The change is expected to be globally available by January 2026.   \"The recipient will receive an email invitation to join the chat session as a guest, enabling seamles...",
        "content": "Cybersecurity researchers have shed light on a cross-tenant blind spot that allows attackers to bypass Microsoft Defender for Office 365 protections via theguest accessfeature in Teams.\n\n\"When users operate as guests in another tenant, their protections are determined entirely by that hosting environment, not by their home organization,\" Ontinue security researcher Rhys Downingsaidin a report.\n\n\"These advancements increase collaboration opportunities, but they also widen the responsibility for ensuring those external environments are trustworthy and properly secured.\"\n\nThe development comes as Microsoft has begun rolling out a new feature in Teams that allows users to chat with anyone via email, including those who don't use the enterprise communications platform, starting this month. The change is expected to be globally available by January 2026.\n\n\"The recipient will receive an email invitation to join the chat session as a guest, enabling seamless communication and collaboration,\" Microsoftsaidin its announcement. \"This update simplifies external engagement and supports flexible work scenarios.\"\n\nIn the event the recipient already uses Teams, they are notified via the app directly in the form of an external message request. The feature is enabled by default, but organizations can turn it off using the TeamsMessagingPolicy bysettingthe \"UseB2BInvitesToAddExternalUsers\" parameter to \"false.\"\n\nThat said, this setting only prevents users from sending invitations to other users. It does not stop them from receiving invitations from external tenants.\n\nAt this stage, it's worth mentioning thatguest accessis different fromexternal access, which allows users to find, call, and chat with people who have Teams but are outside of their organizations.\n\nThe \"fundamental architectural gap\" highlighted by Ontinue stems from the fact thatMicrosoft Defender for Office 365 protectionsfor Teams may not apply when a user accepts a guest invitation to an external tenant. In other words, by entering the other tenant's security boundary, the user is subjected to security policies where the conversation is hosted and not where the user's account lives.\n\nWhat's more, it opens the door to a scenario where the user can become an unprotected guest in a malicious environment that's dictated by the attacker's security policies.\n\nIn a hypothetical attack scenario, a threat actor can create \"protection-free zones\" by disabling all safeguards in their tenants or avail licenses that lack certain options by default. For instance, the attacker can spin up a malicious Microsoft 365 tenant using a low-cost license such as Teams Essentials or Business Basic that doesn't come with Microsoft Defender for Office 365 out of the box.\n\nOnce the unprotected tenant is set up, the attacker can then conduct reconnaissance of the target organization to gather more information and initiate contact via Teams by entering a victim's email address, causing Teams to send an automated invitation to join the chat as a guest.\n\nPerhaps the most concerning aspect of the attack chain is that the email lands on the victim's mailbox. Given that the message originates from Microsoft's own infrastructure, it effectively bypassesSPF, DKIM, and DMARC checks. As a result, email security solutions are unlikely to flag the email as malicious.\n\nShould the victim end up accepting the invitation, they are granted guest access in the attacker's tenant, where all subsequent communication takes place. The threat actor can send phishing links or distribute malware-laced attachments by taking advantage of the lack of Safe Links and Safe Attachments scans.\n\n\"The victim's organization remains completely unaware,\" Downing said. \"Their security controls never triggered because the attack occurred outside their security boundary.\"\n\nTo safeguard against this line of attack, organizations are recommended to restrict B2B collaboration settings to only allow guest invitations from trusted domains, implement cross-tenant access controls, restrict external Teams communication if not required, and train users to watch out for unsolicited Teams invites from external sources.\n\nThe Hacker News has reached out to Microsoft for comment, and we will update the story if we hear back.",
        "tags": [
            {
                "name": "Microsoft Teams",
                "confidence": 1.0
            },
            {
                "name": "Guest Access",
                "confidence": 1.0
            },
            {
                "name": "Microsoft Defender for Office 365",
                "confidence": 1.0
            },
            {
                "name": "External Tenants",
                "confidence": 0.9
            },
            {
                "name": "Cross-tenant blind spot",
                "confidence": 0.9
            },
            {
                "name": "Microsoft",
                "confidence": 0.9
            },
            {
                "name": "Malicious environment",
                "confidence": 0.9
            },
            {
                "name": "Threat actor",
                "confidence": 0.9
            },
            {
                "name": "Phishing",
                "confidence": 0.9
            },
            {
                "name": "Malware",
                "confidence": 0.9
            },
            {
                "name": "Ontinue",
                "confidence": 0.8
            },
            {
                "name": "Architectural gap",
                "confidence": 0.8
            },
            {
                "name": "Microsoft 365",
                "confidence": 0.8
            },
            {
                "name": "Protection-free zones",
                "confidence": 0.8
            },
            {
                "name": "Safe Links",
                "confidence": 0.8
            },
            {
                "name": "Safe Attachments",
                "confidence": 0.8
            },
            {
                "name": "Security boundary",
                "confidence": 0.8
            },
            {
                "name": "Cross-tenant access controls",
                "confidence": 0.8
            },
            {
                "name": "Email",
                "confidence": 0.7
            },
            {
                "name": "SPF",
                "confidence": 0.6
            },
            {
                "name": "DKIM",
                "confidence": 0.6
            },
            {
                "name": "DMARC",
                "confidence": 0.6
            },
            {
                "name": "Email security solutions",
                "confidence": 0.6
            },
            {
                "name": "Reconnaissance",
                "confidence": 0.5
            },
            {
                "name": "TeamsMessagingPolicy",
                "confidence": 0.5
            },
            {
                "name": "B2B Invites",
                "confidence": 0.5
            },
            {
                "name": "External Access",
                "confidence": 0.4
            },
            {
                "name": "Teams Essentials",
                "confidence": 0.4
            },
            {
                "name": "Business Basic",
                "confidence": 0.4
            },
            {
                "name": "User training",
                "confidence": 0.4
            },
            {
                "name": "Collaboration",
                "confidence": 0.4
            }
        ],
        "scraped_at": "2025-11-29T11:30:53.437506"
    },
    {
        "title": "The Ultimate WSUS Replacement Guide for Modern IT Teams",
        "url": "https://thehackernews.uk/wsus-replace-guide",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj7dlPmvsfZfqqoUU5Uud4UGwzXcnV_Xq4YHPpeM48DOhzbjdczsCRIPRYwO2RmFU8iNKFHbPjCT6CJG6orxUo_iLO3aUkTeYgEEE8nArO420iUzJ7Jgm0WGqszDoLnrnOeQeNgt41E7NR9rhic62yrDL9A_w4FeREGm9zSMMfmpykin1U4L0QnVNzjeWRS/s450-rw-e100/action1.jpg",
        "description": "WSUS is officially deprecated. Learn how it holds you back and get a plan to move on for remote endpoints.",
        "content": "",
        "tags": [],
        "scraped_at": "2025-11-29T11:30:37.253469"
    },
    {
        "title": "Why Organizations Are Turning to RPAM",
        "url": "https://thehackernews.com/2025/11/why-organizations-are-turning-to-rpam.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhusj8mwC5L9YXaH6bYVNnFLp4wM8q6RJloaKi4WKGtv4v1ys_SUlcI-q69rWXZCwhwDBdG6Uuy-2eb_1_sbK27TtKqlx37mNgxYB3kZ1lnwN9uMKnHVsrDMiEFhM3ObcANB-aSkvyVRkJn-3FAnKq0CD8F4nuZds4BlIAPT5GCCdHP7CNFG3Bwde-amUw/s790-rw-e365/keeper.jpg",
        "description": "As IT environments become increasingly distributed and organizations adopt hybrid and remote work at scale, traditional perimeter-based security models and on-premises Privileged Access Management (PAM) solutions no longer suffice. IT administrators, contractors and third-party vendors now require secure access to critical systems from any location and on any device, without compromising compliance or increasing security risks. To keep up with modern demands, many organizations are turning to Remote Privileged Access Management (RPAM) for a cloud-based approach to securing privileged access that extends protection beyond on-prem environments to wherever privileged users connect.  Continue reading to learn more about RPAM, how it differs from traditional PAM and why RPAM adoption is growing across all industries.  What is RPAM?  Remote Privileged Access Management  (RPAM) allows organizations to securely monitor and manage privileged access for remote and third-party users. Unlike trad...",
        "content": "As IT environments become increasingly distributed and organizations adopt hybrid and remote work at scale, traditional perimeter-based security models and on-premises Privileged Access Management (PAM) solutions no longer suffice. IT administrators, contractors and third-party vendors now require secure access to critical systems from any location and on any device, without compromising compliance or increasing security risks. To keep up with modern demands, many organizations are turning to Remote Privileged Access Management (RPAM) for a cloud-based approach to securing privileged access that extends protection beyond on-prem environments to wherever privileged users connect.\n\nContinue reading to learn more about RPAM, how it differs from traditional PAM and why RPAM adoption is growing across all industries.\n\nRemote Privileged Access Management(RPAM) allows organizations to securely monitor and manage privileged access for remote and third-party users. Unlike traditional PAM solutions, RPAM extends granular access controls beyond the corporate perimeter, enabling administrators, contractors and vendors to connect securely from any location.\n\nRPAM enforces least-privilege access, verifies user identities and monitors every privileged session, all without exposing credentials or depending on Virtual Private Networks (VPNs). Each privileged session is recorded in detail, giving security teams full visibility into who accessed what and when.\n\nBoth PAM and RPAM help organizations secure privileged access, but they were built for different operational environments. Traditional PAM solutions are designed to monitor and manage privileged accounts within an organization’s internal network. Since they were designed for on-prem environments, legacy PAM solutions struggle to keep up with today’s distributed, cloud-based infrastructures.\n\nRPAM, on the other hand, extends PAM capabilities to modern hybrid and remote environments, providing secure privileged access regardless of a user’s location. In contrast to traditional PAM solutions, RPAM offers secure remote access without requiring VPNs or agent-based deployments, improving scalability and reducing attack surfaces. By supporting zero-trust principles and cloud-native architectures, RPAM gives organizations the control and flexibility needed to protect privileged accounts across modern environments.\n\nTechnology is advancing at such a rapid pace that organizations must accelerate the adoption of RPAM to keep up with the growing need for secure and flexible remote access. Here are the main reasons why RPAM adoption is accelerating so quickly.\n\nWith the steady rise of hybrid and remote work, organizations face increased access challenges beyond their corporate networks. Since employees, contractors and vendors require privileged access to critical systems from various locations and devices, organizations need RPAM to provide policy-based, Just-in-Time (JIT) access to eliminate standing privileges across distributed environments. RPAM ensures that every connection, whether from an internal IT admin or an external vendor, is authorized and monitored to maintain security and transparency.\n\nTraditional remote access methods, including VPNs and Remote Desktop Protocol (RDP) sessions, are commonly targeted attack vectors. Once they have access to stolen credentials or remote systems, cybercriminals can deploy ransomware, steal data or move laterally within an organization’s network. RPAM mitigates these risks by enforcing Multi-Factor Authentication (MFA), recording privileged sessions and supporting zero-trust security. RPAM eliminates the use of shared credentials, ensuring that only continuously verified users can access sensitive data.\n\nOrganizations must comply with a variety of regulatory frameworks, such as ISO 27001 and HIPAA, which require full visibility into privileged activities.RPAM improves security and complianceby automating session logging and recording detailed audit trails. Not only does RPAM streamline audits, but it also provides organizations with valuable insight into privileged activity, helping ensure they align with compliance requirements.\n\nAs remote work and cloud environments continue to modernize enterprises, traditional PAM solutions must evolve to meet the demands of remote access. The future of PAM lies in RPAM solutions that deliver secure, cloud-native control over privileged access across distributed networks. RPAM capabilities, such as agentic AI threat detection, can help organizations identify suspicious activity and proactively prevent potential data breaches before they happen. Modern organizations must shift toward solutions that offer zero-trust architectures, ensuring each access request is authenticated and continuously validated.KeeperPAM®offers a scalable, cloud-native RPAM solution that enables enterprises to secure privileged access and maintain compliance, regardless of where their users are located.",
        "tags": [
            {
                "name": "Remote Privileged Access Management (RPAM)",
                "confidence": 1.0
            },
            {
                "name": "Privileged Access Management (PAM)",
                "confidence": 0.9
            },
            {
                "name": "Remote Work",
                "confidence": 0.9
            },
            {
                "name": "Hybrid Work",
                "confidence": 0.9
            },
            {
                "name": "Distributed Environments",
                "confidence": 0.9
            },
            {
                "name": "Secure Access",
                "confidence": 0.9
            },
            {
                "name": "Cloud-based Security",
                "confidence": 0.85
            },
            {
                "name": "Zero Trust",
                "confidence": 0.85
            },
            {
                "name": "Least Privilege Access",
                "confidence": 0.85
            },
            {
                "name": "Multi-Factor Authentication (MFA)",
                "confidence": 0.8
            },
            {
                "name": "Virtual Private Networks (VPNs)",
                "confidence": 0.8
            },
            {
                "name": "Attack Surface Reduction",
                "confidence": 0.8
            },
            {
                "name": "Regulatory Compliance",
                "confidence": 0.8
            },
            {
                "name": "Session Monitoring",
                "confidence": 0.8
            },
            {
                "name": "Session Recording",
                "confidence": 0.8
            },
            {
                "name": "Audit Trails",
                "confidence": 0.8
            },
            {
                "name": "Ransomware",
                "confidence": 0.8
            },
            {
                "name": "Data Theft",
                "confidence": 0.8
            },
            {
                "name": "Data Breaches",
                "confidence": 0.8
            },
            {
                "name": "Just-in-Time (JIT) Access",
                "confidence": 0.8
            },
            {
                "name": "Cloud-native Architectures",
                "confidence": 0.8
            },
            {
                "name": "Perimeter-based Security",
                "confidence": 0.7
            },
            {
                "name": "On-premises PAM",
                "confidence": 0.7
            },
            {
                "name": "Third-party Access",
                "confidence": 0.7
            },
            {
                "name": "Granular Access Control",
                "confidence": 0.7
            },
            {
                "name": "User Identity Verification",
                "confidence": 0.7
            },
            {
                "name": "Credential Protection",
                "confidence": 0.7
            },
            {
                "name": "Standing Privileges",
                "confidence": 0.7
            },
            {
                "name": "Policy-based Access",
                "confidence": 0.7
            },
            {
                "name": "Scalability",
                "confidence": 0.6
            },
            {
                "name": "Remote Desktop Protocol (RDP)",
                "confidence": 0.6
            },
            {
                "name": "Lateral Movement",
                "confidence": 0.6
            },
            {
                "name": "Shared Credentials",
                "confidence": 0.6
            },
            {
                "name": "Cybercriminals",
                "confidence": 0.6
            },
            {
                "name": "ISO 27001",
                "confidence": 0.5
            },
            {
                "name": "HIPAA",
                "confidence": 0.5
            },
            {
                "name": "AI Threat Detection",
                "confidence": 0.5
            },
            {
                "name": "Agent-based Deployments",
                "confidence": 0.3
            },
            {
                "name": "Internal Network Security",
                "confidence": 0.3
            },
            {
                "name": "KeeperPAM",
                "confidence": 0.1
            }
        ],
        "scraped_at": "2025-11-29T11:30:33.979036"
    },
    {
        "title": "North Korean Hackers Deploy 197 npm Packages to Spread Updated OtterCookie Malware",
        "url": "https://thehackernews.com/2025/11/north-korean-hackers-deploy-197-npm.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbHywoT-t7dx-yFp5L6Kj6AHPWvHYFoziGtqauAQGWvY55xCGgiw80AKaK962SgdMmomBf9EMT9cPAGPxx5GTi4lFq_ckm1Cjk3hGtRo1AnWVEjZkd89HlSOWuLuBC-whL565LElFcq2D55c9NrmQHx30eGNNugpcLqPAKDxRC5Zkwb-1lX1OC4Xu-QH13/s790-rw-e365/npm-malware.jpg",
        "description": "The North Korean threat actors behind the Contagious Interview campaign have continued to flood the npm registry with 197 more malicious packages since last month .  According to Socket , these packages have been downloaded over 31,000 times, and are designed to deliver a variant of OtterCookie that brings together the features of BeaverTail and prior versions of OtterCookie.   Some of the identified \"loader\" packages are listed below -   bcryptjs-node  cross-sessions  json-oauth  node-tailwind  react-adparser  session-keeper  tailwind-magic  tailwindcss-forms  webpack-loadcss    The malware, once launched, attempts to evade sandboxes and virtual machines, profiles the machine, and then establishes a command-and-control (C2) channel to provide the attackers with a remote shell, along with capabilities to steal clipboard contents, log keystrokes, capture screenshots, and gather browser credentials, documents, cryptocurrency wallet data, and seed phrases.  It's worth notin...",
        "content": "The North Korean threat actors behind the Contagious Interview campaign have continued to flood the npm registry with 197 more malicious packagessince last month.\n\nAccording toSocket, these packages have been downloaded over 31,000 times, and are designed to deliver a variant of OtterCookie that brings together the features of BeaverTail and prior versions of OtterCookie.\n\nSome of the identified \"loader\" packages are listed below -\n\nThe malware, once launched, attempts to evade sandboxes and virtual machines, profiles the machine, and then establishes a command-and-control (C2) channel to provide the attackers with a remote shell, along with capabilities to steal clipboard contents, log keystrokes, capture screenshots, and gather browser credentials, documents, cryptocurrency wallet data, and seed phrases.\n\nIt's worth noting that the blurring distinction between OtterCookie and BeaverTail wasdocumentedby Cisco Talos last month in connection with an infection that impacted a system associated with an organization headquartered in Sri Lanka after a user was likely deceived into running a Node.js application as part of a fake job interview process.\n\nFurther analysis has determined that the packages are designed to connect to a hard-coded Vercel URL (\"tetrismic.vercel[.]app\"), which then proceeds to fetch the cross-platform OtterCookie payload from a threat actor-controlled GitHub repository. The GitHub account that serves as the delivery vehicle,stardev0914, is no longer accessible.\n\n\"This sustained tempo makes Contagious Interview one of the most prolific campaigns exploiting npm, and it shows how thoroughly North Korean threat actors have adapted their tooling to modern JavaScript and crypto-centric development workflows,\" security researcher Kirill Boychenko said.\n\nThe development comes as fake assessment-themed websites created by the threat actors haveleveragedClickFix-style instructions to deliver malware referred to asGolangGhost(aka FlexibleFerret or WeaselStore) under the pretext of fixing camera or microphone issues. The activity is tracked under the moniker ClickFake Interview.\n\nWritten in Go, the malware contacts a hard-coded C2 server and enters into a persistent command-processing loop to collect system information, upload/download files, run operating system commands, and harvest information from Google Chrome. Persistence is achieved by writing a macOS LaunchAgent that triggers its execution by means of a shell script automatically upon user login.\n\nAlso installed as part of the attack chain is a decoy application that displays a bogus Chrome camera access prompt to keep up the ruse. Subsequently, it presents a Chrome-style password prompt that captures the content entered by the user and sends it to a Dropbox account.\n\n\"Although there is some overlap, this campaign is distinct from otherDPRK IT Worker schemesthat focus onembedding actorswithin legitimate businesses under false identities,\" Validinsaid. \"Contagious Interview, by contrast, is designed to compromise individuals through staged recruiting pipelines, malicious coding exercises, and fraudulent hiring platforms, weaponizing the job application process itself.\"",
        "tags": [
            {
                "name": "North Korean Hackers",
                "confidence": 0.95
            },
            {
                "name": "npm packages",
                "confidence": 0.9
            },
            {
                "name": "OtterCookie",
                "confidence": 0.95
            },
            {
                "name": "Contagious Interview",
                "confidence": 0.95
            },
            {
                "name": "npm registry",
                "confidence": 0.85
            },
            {
                "name": "BeaverTail",
                "confidence": 0.8
            },
            {
                "name": "Malware evasion",
                "confidence": 0.7
            },
            {
                "name": "Command and Control (C2)",
                "confidence": 0.9
            },
            {
                "name": "Browser credential theft",
                "confidence": 0.8
            },
            {
                "name": "Cryptocurrency wallet data theft",
                "confidence": 0.85
            },
            {
                "name": "Seed phrase theft",
                "confidence": 0.85
            },
            {
                "name": "Node.js",
                "confidence": 0.8
            },
            {
                "name": "Fake job interview",
                "confidence": 0.9
            },
            {
                "name": "Vercel",
                "confidence": 0.8
            },
            {
                "name": "GitHub",
                "confidence": 0.8
            },
            {
                "name": "JavaScript",
                "confidence": 0.7
            },
            {
                "name": "GolangGhost",
                "confidence": 0.85
            },
            {
                "name": "FlexibleFerret",
                "confidence": 0.75
            },
            {
                "name": "WeaselStore",
                "confidence": 0.75
            },
            {
                "name": "ClickFake Interview",
                "confidence": 0.85
            },
            {
                "name": "Go language",
                "confidence": 0.8
            },
            {
                "name": "Google Chrome",
                "confidence": 0.75
            },
            {
                "name": "macOS LaunchAgent",
                "confidence": 0.7
            },
            {
                "name": "Social engineering",
                "confidence": 0.9
            },
            {
                "name": "Malicious coding exercises",
                "confidence": 0.8
            },
            {
                "name": "Fraudulent hiring platforms",
                "confidence": 0.8
            },
            {
                "name": "Weaponizing job application process",
                "confidence": 0.9
            },
            {
                "name": "Persistence",
                "confidence": 0.7
            },
            {
                "name": "Data exfiltration",
                "confidence": 0.7
            },
            {
                "name": "Keylogging",
                "confidence": 0.6
            },
            {
                "name": "Screenshot capture",
                "confidence": 0.6
            },
            {
                "name": "Clipboard contents theft",
                "confidence": 0.6
            },
            {
                "name": "Virtual machines",
                "confidence": 0.5
            },
            {
                "name": "Sandboxes",
                "confidence": 0.5
            },
            {
                "name": "Cisco Talos",
                "confidence": 0.5
            },
            {
                "name": "Sri Lanka",
                "confidence": 0.4
            },
            {
                "name": "Dropbox",
                "confidence": 0.5
            },
            {
                "name": "DPRK IT Worker schemes",
                "confidence": 0.5
            },
            {
                "name": "System profiling",
                "confidence": 0.6
            },
            {
                "name": "Loader packages",
                "confidence": 0.6
            }
        ],
        "scraped_at": "2025-11-29T11:30:15.325521"
    },
    {
        "title": "Legacy Python Bootstrap Scripts Create Domain-Takeover Risk in Multiple PyPI Packages",
        "url": "https://thehackernews.com/2025/11/legacy-python-bootstrap-scripts-create.html",
        "thumbnail": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMdVHqK8sA27WWR3ySGxson4kuqmBaXHQlFm3PSmRaHV6IGdnk_zK0tUvgrFyKepL2COnnm_yiIBdTy-ho7pFKSPQP7cCxkOugoV0s_2k3dUBYC0FI5BkY2tmR3Tsbxktsq7TnQRqzDhiOHe9SjVrRq2XHt5BYU01ctj8yUA8BTv6cDT8zREtEYAdrViUn/s790-rw-e365/setuptools.jpg",
        "description": "Cybersecurity researchers have discovered vulnerable code in legacy Python packages that could potentially pave the way for a supply chain compromise on the Python Package Index (PyPI) via a domain takeover attack.  Software supply chain security company ReversingLabs said it found the \"vulnerability\" in bootstrap files provided by a build and deployment automation tool named \"zc.buildout.\"  \"The scripts automate the process of downloading, building, and installing the required libraries and tools,\" security researcher Vladimir Pezo said . \"Specifically, when the bootstrap script is executed, it fetches and executes an installation script for the package Distribute from python-distribute[.]org – a legacy domain that is now available for sale in the premium price range while being managed to drive ad revenue.\"  The PyPI packages that include a bootstrap script that accesses the domain in question include tornado, pypiserver, slapos.core, roman, x...",
        "content": "Cybersecurity researchers have discovered vulnerable code in legacy Python packages that could potentially pave the way for a supply chain compromise on the Python Package Index (PyPI) via a domain takeover attack.\n\nSoftware supply chain security company ReversingLabs said it found the \"vulnerability\" in bootstrap files provided by a build and deployment automation tool named \"zc.buildout.\"\n\n\"The scripts automate the process of downloading, building, and installing the required libraries and tools,\" security researcher Vladimir Pezosaid. \"Specifically, when the bootstrap script is executed, it fetches and executes an installation script for the package Distribute from python-distribute[.]org – a legacy domain that is now available for sale in the premium price range while being managed to drive ad revenue.\"\n\nThe PyPI packages that include a bootstrap script that accesses the domain in question include tornado, pypiserver, slapos.core, roman, xlutils, and testfixtures.\n\nThe crux of the problem concerns anold bootstrap script(\"bootstrap.py\") that was used along with the zc.buildout tool to initialize the Buildout environment. The Python script also supported the ability to install a packaging utility called \"Distribute,\" a short-lived fork of the Setuptools project, into the local environment.\n\nTo achieve this, the Distribute installation script (\"distribute_setup.py\") is fetched from the python-distribute[.]org, a domain that has been up for sale since 2014. In adding the option, the idea was to instruct the bootstrap script to download and install the Distribute package instead of the older Setuptools package to manage eggs and dependencies for the buildout.\n\nIt's important to note that the Distribute fork came into being due to the lack of active development of Setuptools, the main package management tool used at that time. However, the features from Distribute were integrated back into Setuptools in 2013, rendering Distribute obsolete.\n\nThe issue identified by ReversingLabs concerns the fact that many packages have continued to ship the bootstrap script that either attempts to install Distribute by default or when the command-line option (\"-d\" or \"--distribute\") is specified. This, coupled with the fact that the domain in question is up for grabs, puts users at latent risk as an attacker could weaponize this setup to serve malicious code when the bootstrap script is inadvertently run and potentially steal sensitive data.\n\nWhile some of the affected packages have taken steps to remove the bootstrap script, the slapos.core package still continues to ship the vulnerable code. It's also included in the development and maintenance version of Tornado.\n\nAnother important aspect to consider here is that the bootstrap script is not executed automatically during the package installation and is written in Python 2. This means the script cannot be executed with Python 3 without modifications. But the mere presence of the file leaves an \"unnecessary attack surface\" that attackers can exploit if developers are tricked into running code that triggers the execution of the bootstrap script.\n\nThe threat of a domain takeover is not theoretical. In 2023, it came to light that the npm package fsevents was compromised by a bad actor who seized control of an unclaimed cloud resource hosted at fsevents-binaries.s3-us-west-2.amazonaws[.]com to push malicious executables to users installing certain versions of the package (CVE-2023-45311, CVSS score: 9.8).\n\n\"The issue lies in the programming pattern that includes fetching and executing a payload from a hard-coded domain, which is a pattern commonly observed in malware exhibiting downloader behavior,\" Pezo said. \"The failure to formally decommission the Distribute module allowed vulnerable bootstrap scripts to linger and left unknown numbers of projects exposed to a potential attack.\"\n\nThe disclosure comes as HelixGuard discovered a malicious package in PyPI named \"spellcheckers\" that claims to be a tool for checking spelling errors using OpenAI Vision, but contains malicious code that's designed to connect to an external server and download a next-stage payload, which then executes a remote access trojan (RAT).\n\nThe package, firstuploadedto PyPI on November 15, 2025, by a user namedleo636722, has beendownloaded 955 times. It's no longer available for download.\n\n\"This RAT can receive remote commands and execute attacker-controlled Python code via exec(), enabling full remote control over the victim's host,\" HelixGuardsaid. \"When the user installs and runs the malicious package, the backdoor becomes active, allowing the attacker to remotely control the user's computer.\"",
        "tags": [
            {
                "name": "Python",
                "confidence": 0.9
            },
            {
                "name": "PyPI",
                "confidence": 0.95
            },
            {
                "name": "Domain Takeover",
                "confidence": 1.0
            },
            {
                "name": "Supply Chain Compromise",
                "confidence": 0.9
            },
            {
                "name": "Software Supply Chain Security",
                "confidence": 0.9
            },
            {
                "name": "Bootstrap Scripts",
                "confidence": 0.95
            },
            {
                "name": "zc.buildout",
                "confidence": 0.85
            },
            {
                "name": "Distribute",
                "confidence": 0.9
            },
            {
                "name": "Setuptools",
                "confidence": 0.7
            },
            {
                "name": "python-distribute[.]org",
                "confidence": 0.9
            },
            {
                "name": "ReversingLabs",
                "confidence": 0.85
            },
            {
                "name": "Vulnerability",
                "confidence": 0.9
            },
            {
                "name": "Malicious Code",
                "confidence": 0.8
            },
            {
                "name": "Unnecessary Attack Surface",
                "confidence": 0.8
            },
            {
                "name": "Python 2",
                "confidence": 0.6
            },
            {
                "name": "Python 3",
                "confidence": 0.4
            },
            {
                "name": "npm",
                "confidence": 0.6
            },
            {
                "name": "fsevents",
                "confidence": 0.5
            },
            {
                "name": "CVE-2023-45311",
                "confidence": 0.5
            },
            {
                "name": "Hard-coded domain",
                "confidence": 0.75
            },
            {
                "name": "Package Management",
                "confidence": 0.6
            },
            {
                "name": "Remote Access Trojan (RAT)",
                "confidence": 0.65
            },
            {
                "name": "spellcheckers",
                "confidence": 0.6
            },
            {
                "name": "HelixGuard",
                "confidence": 0.5
            },
            {
                "name": "tornado",
                "confidence": 0.7
            },
            {
                "name": "slapos.core",
                "confidence": 0.75
            },
            {
                "name": "pypiserver",
                "confidence": 0.6
            },
            {
                "name": "roman",
                "confidence": 0.6
            },
            {
                "name": "xlutils",
                "confidence": 0.6
            },
            {
                "name": "testfixtures",
                "confidence": 0.6
            },
            {
                "name": "OpenAI Vision",
                "confidence": 0.3
            },
            {
                "name": "exec()",
                "confidence": 0.4
            }
        ],
        "scraped_at": "2025-11-29T11:29:07.984290"
    }
]